IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
<module name="DEBUGSS_DEBUGSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="DEBUGSS_ONEMCU_APB_BASE" acronym="DEBUGSS_ONEMCU_APB_BASE" offset="0x0" width="32" description="">
		<bitfield id="ONEMCU_APB_BASE" width="32" begin="31" end="0" resetval="0x0" description="OneMCU APB Space : Start Address of ROM Table" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_APB_BASE_END" acronym="DEBUGSS_ONEMCU_APB_BASE_END" offset="0xFFC" width="32" description="">
		<bitfield id="ONEMCU_APB_BASE_END" width="32" begin="31" end="0" resetval="0x0" description="OneMCU APB Space : Endt Address of ROM Table" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_CONTROL" acronym="DEBUGSS_ONEMCU_CTI_CONTROL" offset="0x1000" width="32" description="">
		<bitfield id="ONEMCU_CTI_CONTROL" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDGDIHE.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDHBDIA.html" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INTACK" acronym="DEBUGSS_ONEMCU_CTI_INTACK" offset="0x1010" width="32" description="">
		<bitfield id="ONEMCU_CTI_INTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_APPSET" acronym="DEBUGSS_ONEMCU_CTI_APPSET" offset="0x1014" width="32" description="">
		<bitfield id="ONEMCU_CTI_APPSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_APPCLEAR" acronym="DEBUGSS_ONEMCU_CTI_APPCLEAR" offset="0x1018" width="32" description="">
		<bitfield id="ONEMCU_CTI_APPCLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_APPPULSE" acronym="DEBUGSS_ONEMCU_CTI_APPPULSE" offset="0x101C" width="32" description="">
		<bitfield id="ONEMCU_CTI_APPPULSE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN0" acronym="DEBUGSS_ONEMCU_CTI_INEN0" offset="0x1020" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN1" acronym="DEBUGSS_ONEMCU_CTI_INEN1" offset="0x1024" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN2" acronym="DEBUGSS_ONEMCU_CTI_INEN2" offset="0x1028" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN3" acronym="DEBUGSS_ONEMCU_CTI_INEN3" offset="0x102C" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN4" acronym="DEBUGSS_ONEMCU_CTI_INEN4" offset="0x1030" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN5" acronym="DEBUGSS_ONEMCU_CTI_INEN5" offset="0x1034" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN6" acronym="DEBUGSS_ONEMCU_CTI_INEN6" offset="0x1038" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_INEN7" acronym="DEBUGSS_ONEMCU_CTI_INEN7" offset="0x103C" width="32" description="">
		<bitfield id="ONEMCU_CTI_INEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN0" acronym="DEBUGSS_ONEMCU_CTI_OUTEN0" offset="0x10A0" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN1" acronym="DEBUGSS_ONEMCU_CTI_OUTEN1" offset="0x10A4" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN2" acronym="DEBUGSS_ONEMCU_CTI_OUTEN2" offset="0x10A8" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN3" acronym="DEBUGSS_ONEMCU_CTI_OUTEN3" offset="0x10AC" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN4" acronym="DEBUGSS_ONEMCU_CTI_OUTEN4" offset="0x10B0" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN5" acronym="DEBUGSS_ONEMCU_CTI_OUTEN5" offset="0x10B4" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN6" acronym="DEBUGSS_ONEMCU_CTI_OUTEN6" offset="0x10B8" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_OUTEN7" acronym="DEBUGSS_ONEMCU_CTI_OUTEN7" offset="0x10BC" width="32" description="">
		<bitfield id="ONEMCU_CTI_OUTEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_TRIGINSTATUS" acronym="DEBUGSS_ONEMCU_CTI_TRIGINSTATUS" offset="0x1130" width="32" description="">
		<bitfield id="ONEMCU_CTI_TRIGINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
