IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_ONEMCU_CTI_TRIGOUTSTATUS" acronym="DEBUGSS_ONEMCU_CTI_TRIGOUTSTATUS" offset="0x1134" width="32" description="">
		<bitfield id="ONEMCU_CTI_TRIGOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_CHINSTATUS" acronym="DEBUGSS_ONEMCU_CTI_CHINSTATUS" offset="0x1138" width="32" description="">
		<bitfield id="ONEMCU_CTI_CHINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_CHOUTSTATUS" acronym="DEBUGSS_ONEMCU_CTI_CHOUTSTATUS" offset="0x113C" width="32" description="">
		<bitfield id="ONEMCU_CTI_CHOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_GATE" acronym="DEBUGSS_ONEMCU_CTI_GATE" offset="0x1140" width="32" description="">
		<bitfield id="ONEMCU_CTI_GATE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ASICCTL" acronym="DEBUGSS_ONEMCU_CTI_ASICCTL" offset="0x1144" width="32" description="">
		<bitfield id="ONEMCU_CTI_ASICCTL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITCHINACK" acronym="DEBUGSS_ONEMCU_CTI_ITCHINACK" offset="0x1EDC" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITCHINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITTRIGINACK" acronym="DEBUGSS_ONEMCU_CTI_ITTRIGINACK" offset="0x1EE0" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITTRIGINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITCHOUT" acronym="DEBUGSS_ONEMCU_CTI_ITCHOUT" offset="0x1EE4" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITCHOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITTRIGOUT" acronym="DEBUGSS_ONEMCU_CTI_ITTRIGOUT" offset="0x1EE8" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITTRIGOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITCHOUTACK" acronym="DEBUGSS_ONEMCU_CTI_ITCHOUTACK" offset="0x1EEC" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITCHOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITTRIGOUTACK" acronym="DEBUGSS_ONEMCU_CTI_ITTRIGOUTACK" offset="0x1EF0" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITTRIGOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITCHIN" acronym="DEBUGSS_ONEMCU_CTI_ITCHIN" offset="0x1EF4" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITCHIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITTRIGIN" acronym="DEBUGSS_ONEMCU_CTI_ITTRIGIN" offset="0x1EF8" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITTRIGIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_ITCTRL" acronym="DEBUGSS_ONEMCU_CTI_ITCTRL" offset="0x1F00" width="32" description="">
		<bitfield id="ONEMCU_CTI_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_CLAIM_TAG_SET" acronym="DEBUGSS_ONEMCU_CTI_CLAIM_TAG_SET" offset="0x1FA0" width="32" description="">
		<bitfield id="ONEMCU_CTI_CLAIM_TAG_SET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_CLAIM_TAG_CLEAR" acronym="DEBUGSS_ONEMCU_CTI_CLAIM_TAG_CLEAR" offset="0x1FA4" width="32" description="">
		<bitfield id="ONEMCU_CTI_CLAIM_TAG_CLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_LOCK_ACCESS_REGISTER" acronym="DEBUGSS_ONEMCU_CTI_LOCK_ACCESS_REGISTER" offset="0x1FB0" width="32" description="">
		<bitfield id="ONEMCU_CTI_LOCK_ACCESS_REGISTER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_LOCK_STATUS_REGISTER" acronym="DEBUGSS_ONEMCU_CTI_LOCK_STATUS_REGISTER" offset="0x1FB4" width="32" description="">
		<bitfield id="ONEMCU_CTI_LOCK_STATUS_REGISTER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_AUTHENTICATION_STATUS" acronym="DEBUGSS_ONEMCU_CTI_AUTHENTICATION_STATUS" offset="0x1FB8" width="32" description="">
		<bitfield id="ONEMCU_CTI_AUTHENTICATION_STATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_DEVICE_ID" acronym="DEBUGSS_ONEMCU_CTI_DEVICE_ID" offset="0x1FC8" width="32" description="">
		<bitfield id="ONEMCU_CTI_DEVICE_ID" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_DEVICE_TYPE_IDENTIFIER" acronym="DEBUGSS_ONEMCU_CTI_DEVICE_TYPE_IDENTIFIER" offset="0x1FCC" width="32" description="">
		<bitfield id="ONEMCU_CTI_DEVICE_TYPE_IDENTIFIER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
