IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID4" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID4" offset="0x1FD0" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID5" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID5" offset="0x1FD4" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID6" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID6" offset="0x1FD8" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID7" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID7" offset="0x1FDC" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID0" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID0" offset="0x1FE0" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID1" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID1" offset="0x1FE4" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID2" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID2" offset="0x1FE8" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_PERIPHERALID3" acronym="DEBUGSS_ONEMCU_CTI_PERIPHERALID3" offset="0x1FEC" width="32" description="">
		<bitfield id="ONEMCU_CTI_PERIPHERALID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_COMPONENT_ID0" acronym="DEBUGSS_ONEMCU_CTI_COMPONENT_ID0" offset="0x1FF0" width="32" description="">
		<bitfield id="ONEMCU_CTI_COMPONENT_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_COMPONENT_ID1" acronym="DEBUGSS_ONEMCU_CTI_COMPONENT_ID1" offset="0x1FF4" width="32" description="">
		<bitfield id="ONEMCU_CTI_COMPONENT_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_COMPONENT_ID2" acronym="DEBUGSS_ONEMCU_CTI_COMPONENT_ID2" offset="0x1FF8" width="32" description="">
		<bitfield id="ONEMCU_CTI_COMPONENT_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_CTI_COMPONENT_ID3" acronym="DEBUGSS_ONEMCU_CTI_COMPONENT_ID3" offset="0x1FFC" width="32" description="">
		<bitfield id="ONEMCU_CTI_COMPONENT_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_SPORTSZ" acronym="DEBUGSS_ONEMCU_TPIU_SPORTSZ" offset="0x2000" width="32" description="">
		<bitfield id="ONEMCU_TPIU_SPORTSZ" width="32" begin="31" end="0" resetval="0x268435455" description="Supported port sizes" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_CPORTSZ" acronym="DEBUGSS_ONEMCU_TPIU_CPORTSZ" offset="0x2004" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CPORTSZ" width="32" begin="31" end="0" resetval="0x1" description="Current port size" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_STRIGM" acronym="DEBUGSS_ONEMCU_TPIU_STRIGM" offset="0x2100" width="32" description="">
		<bitfield id="ONEMCU_TPIU_STRIGM" width="32" begin="31" end="0" resetval="0x287" description="Supported trigger modes" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_TRIGCNT" acronym="DEBUGSS_ONEMCU_TPIU_TRIGCNT" offset="0x2104" width="32" description="">
		<bitfield id="ONEMCU_TPIU_TRIGCNT" width="32" begin="31" end="0" resetval="0x0" description="Trigger counter value" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_TRIGMUL" acronym="DEBUGSS_ONEMCU_TPIU_TRIGMUL" offset="0x2108" width="32" description="">
		<bitfield id="ONEMCU_TPIU_TRIGMUL" width="32" begin="31" end="0" resetval="0x0" description="Trigger multiplier" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_STSTPTRN" acronym="DEBUGSS_ONEMCU_TPIU_STSTPTRN" offset="0x2200" width="32" description="">
		<bitfield id="ONEMCU_TPIU_STSTPTRN" width="32" begin="31" end="0" resetval="0x196623" description="Supported test pattern/modes" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_CTSTPTRN" acronym="DEBUGSS_ONEMCU_TPIU_CTSTPTRN" offset="0x2204" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CTSTPTRN" width="32" begin="31" end="0" resetval="0x0" description="Current test pattern/mode" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_TPRCNTR" acronym="DEBUGSS_ONEMCU_TPIU_TPRCNTR" offset="0x2208" width="32" description="">
		<bitfield id="ONEMCU_TPIU_TPRCNTR" width="32" begin="31" end="0" resetval="0x0" description="Test pattern repeat counter" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_FFSTS" acronym="DEBUGSS_ONEMCU_TPIU_FFSTS" offset="0x2300" width="32" description="">
		<bitfield id="ONEMCU_TPIU_FFSTS" width="32" begin="31" end="0" resetval="0x2" description="Formatter and flush status" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_FFCTRL" acronym="DEBUGSS_ONEMCU_TPIU_FFCTRL" offset="0x2304" width="32" description="">
		<bitfield id="ONEMCU_TPIU_FFCTRL" width="32" begin="31" end="0" resetval="0x4096" description="Formatter and flush control" range="31 - 0" rwaccess="RW"/>
	</register>
