IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_ONEMCU_TPIU_FSCNTR" acronym="DEBUGSS_ONEMCU_TPIU_FSCNTR" offset="0x2308" width="32" description="">
		<bitfield id="ONEMCU_TPIU_FSCNTR" width="32" begin="31" end="0" resetval="0x64" description="Formatter synchronization counter" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_EXCTLIN" acronym="DEBUGSS_ONEMCU_TPIU_EXCTLIN" offset="0x2400" width="32" description="">
		<bitfield id="ONEMCU_TPIU_EXCTLIN" width="32" begin="31" end="0" resetval="0x0" description="EXTCTL In Port" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_EXCTLOUT" acronym="DEBUGSS_ONEMCU_TPIU_EXCTLOUT" offset="0x2404" width="32" description="">
		<bitfield id="ONEMCU_TPIU_EXCTLOUT" width="32" begin="31" end="0" resetval="0x0" description="EXTCTL Out Port" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_ITTRFLINACK" acronym="DEBUGSS_ONEMCU_TPIU_ITTRFLINACK" offset="0x2EE4" width="32" description="">
		<bitfield id="ONEMCU_TPIU_ITTRFLINACK" width="32" begin="31" end="0" resetval="0x0" description="Integration Register, ITTRFLINACK" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_ITTRFLIN" acronym="DEBUGSS_ONEMCU_TPIU_ITTRFLIN" offset="0x2EE8" width="32" description="">
		<bitfield id="ONEMCU_TPIU_ITTRFLIN" width="32" begin="31" end="0" resetval="0x0" description="Integration Register, ITTRFLIN" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_ITATBDATA0" acronym="DEBUGSS_ONEMCU_TPIU_ITATBDATA0" offset="0x2EEC" width="32" description="">
		<bitfield id="ONEMCU_TPIU_ITATBDATA0" width="32" begin="31" end="0" resetval="0x0" description="Integration Register, ITATBDATA0" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_ITATBCTR2" acronym="DEBUGSS_ONEMCU_TPIU_ITATBCTR2" offset="0x2EF0" width="32" description="">
		<bitfield id="ONEMCU_TPIU_ITATBCTR2" width="32" begin="31" end="0" resetval="0x0" description="Integration Register, ITATBCTR2" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_ITATBCTR1" acronym="DEBUGSS_ONEMCU_TPIU_ITATBCTR1" offset="0x2EF4" width="32" description="">
		<bitfield id="ONEMCU_TPIU_ITATBCTR1" width="32" begin="31" end="0" resetval="0x0" description="Integration Register, ITATBCTR1" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_ITATBCTR0" acronym="DEBUGSS_ONEMCU_TPIU_ITATBCTR0" offset="0x2EF8" width="32" description="">
		<bitfield id="ONEMCU_TPIU_ITATBCTR0" width="32" begin="31" end="0" resetval="0x0" description="Integration Register, ITATBCTR0" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_ITCTRL" acronym="DEBUGSS_ONEMCU_TPIU_ITCTRL" offset="0x2F00" width="32" description="">
		<bitfield id="ONEMCU_TPIU_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Integration Mode Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_CLAIMSET" acronym="DEBUGSS_ONEMCU_TPIU_CLAIMSET" offset="0x2FA0" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CLAIMSET" width="32" begin="31" end="0" resetval="0x15" description="Claim Tag Set" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_CLAIMCLR" acronym="DEBUGSS_ONEMCU_TPIU_CLAIMCLR" offset="0x2FA4" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Claim Tag Clear" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_LAR" acronym="DEBUGSS_ONEMCU_TPIU_LAR" offset="0x2FB0" width="32" description="">
		<bitfield id="ONEMCU_TPIU_LAR" width="32" begin="31" end="0" resetval="0x0" description="Lock status" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_LSR" acronym="DEBUGSS_ONEMCU_TPIU_LSR" offset="0x2FB4" width="32" description="">
		<bitfield id="ONEMCU_TPIU_LSR" width="32" begin="31" end="0" resetval="0x0" description="Lock Access" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_AUTHSTATUS" acronym="DEBUGSS_ONEMCU_TPIU_AUTHSTATUS" offset="0x2FB8" width="32" description="">
		<bitfield id="ONEMCU_TPIU_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Authentication status" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_DEVID" acronym="DEBUGSS_ONEMCU_TPIU_DEVID" offset="0x2FC8" width="32" description="">
		<bitfield id="ONEMCU_TPIU_DEVID" width="32" begin="31" end="0" resetval="0x160" description="Device ID" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_DEVTYPE" acronym="DEBUGSS_ONEMCU_TPIU_DEVTYPE" offset="0x2FCC" width="32" description="">
		<bitfield id="ONEMCU_TPIU_DEVTYPE" width="32" begin="31" end="0" resetval="0x17" description="Device type identifier" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR4" acronym="DEBUGSS_ONEMCU_TPIU_PIDR4" offset="0x2FD0" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR4" width="32" begin="31" end="0" resetval="0x4" description="Peripheral ID4" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR5" acronym="DEBUGSS_ONEMCU_TPIU_PIDR5" offset="0x2FD4" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR5" width="32" begin="31" end="0" resetval="0x0" description="Peripheral ID5" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR6" acronym="DEBUGSS_ONEMCU_TPIU_PIDR6" offset="0x2FD8" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR6" width="32" begin="31" end="0" resetval="0x0" description="Peripheral ID6" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR7" acronym="DEBUGSS_ONEMCU_TPIU_PIDR7" offset="0x2FDC" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR7" width="32" begin="31" end="0" resetval="0x0" description="Peripheral ID7" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR0" acronym="DEBUGSS_ONEMCU_TPIU_PIDR0" offset="0x2FE0" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR0" width="32" begin="31" end="0" resetval="0x18" description="Peripheral ID0" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR1" acronym="DEBUGSS_ONEMCU_TPIU_PIDR1" offset="0x2FE4" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR1" width="32" begin="31" end="0" resetval="0x185" description="Peripheral ID1" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR2" acronym="DEBUGSS_ONEMCU_TPIU_PIDR2" offset="0x2FE8" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR2" width="32" begin="31" end="0" resetval="0x59" description="Peripheral ID2" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_PIDR3" acronym="DEBUGSS_ONEMCU_TPIU_PIDR3" offset="0x2FEC" width="32" description="">
		<bitfield id="ONEMCU_TPIU_PIDR3" width="32" begin="31" end="0" resetval="0x0" description="Peripheral ID3" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_CIDR0" acronym="DEBUGSS_ONEMCU_TPIU_CIDR0" offset="0x2FF0" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CIDR0" width="32" begin="31" end="0" resetval="0x13" description="Component ID0" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_CIDR1" acronym="DEBUGSS_ONEMCU_TPIU_CIDR1" offset="0x2FF4" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CIDR1" width="32" begin="31" end="0" resetval="0x144" description="Component ID1" range="31 - 0" rwaccess="RO"/>
	</register>
