IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_ONEMCU_TPIU_CIDR2" acronym="DEBUGSS_ONEMCU_TPIU_CIDR2" offset="0x2FF8" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CIDR2" width="32" begin="31" end="0" resetval="0x5" description="Component ID2" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ONEMCU_TPIU_CIDR3" acronym="DEBUGSS_ONEMCU_TPIU_CIDR3" offset="0x2FFC" width="32" description="">
		<bitfield id="ONEMCU_TPIU_CIDR3" width="32" begin="31" end="0" resetval="0x177" description="Component ID3" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_APB_EXT_PORT0_ROM" acronym="DEBUGSS_APB_EXT_PORT0_ROM" offset="0x10000" width="32" description="">
		<bitfield id="ATB_REPLICATOR_IDFILTER0" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDFGIED.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDBDCII.html" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_IDFILTER0" acronym="DEBUGSS_ATB_REPLICATOR_IDFILTER0" offset="0x11000" width="32" description="">
		<bitfield id="ATB_REPLICATOR_IDFILTER1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_IDFILTER1" acronym="DEBUGSS_ATB_REPLICATOR_IDFILTER1" offset="0x11004" width="32" description="">
		<bitfield id="ATB_REPLICATOR_ITATBCTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_ITATBCTR1" acronym="DEBUGSS_ATB_REPLICATOR_ITATBCTR1" offset="0x11EF8" width="32" description="">
		<bitfield id="ATB_REPLICATOR_ITATBCTR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_ITATBCTR0" acronym="DEBUGSS_ATB_REPLICATOR_ITATBCTR0" offset="0x11EFC" width="32" description="">
		<bitfield id="ATB_REPLICATOR_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_ITCTRL" acronym="DEBUGSS_ATB_REPLICATOR_ITCTRL" offset="0x11F00" width="32" description="">
		<bitfield id="ATB_REPLICATOR_CLAIMSET" width="32" begin="31" end="0" resetval="0x15" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_CLAIMSET" acronym="DEBUGSS_ATB_REPLICATOR_CLAIMSET" offset="0x11FA0" width="32" description="">
		<bitfield id="ATB_REPLICATOR_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_CLAIMCLR" acronym="DEBUGSS_ATB_REPLICATOR_CLAIMCLR" offset="0x11FA4" width="32" description="">
		<bitfield id="ATB_REPLICATOR_LAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_LAR" acronym="DEBUGSS_ATB_REPLICATOR_LAR" offset="0x11FB0" width="32" description="">
		<bitfield id="ATB_REPLICATOR_LSR" width="32" begin="31" end="0" resetval="0x3" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_LSR" acronym="DEBUGSS_ATB_REPLICATOR_LSR" offset="0x11FB4" width="32" description="">
		<bitfield id="ATB_REPLICATOR_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_AUTHSTATUS" acronym="DEBUGSS_ATB_REPLICATOR_AUTHSTATUS" offset="0x11FB8" width="32" description="">
		<bitfield id="ATB_REPLICATOR_DEVID" width="32" begin="31" end="0" resetval="0x2" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_DEVID" acronym="DEBUGSS_ATB_REPLICATOR_DEVID" offset="0x11FC8" width="32" description="">
		<bitfield id="ATB_REPLICATOR_DEVTYPE" width="32" begin="31" end="0" resetval="0x34" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_DEVTYPE" acronym="DEBUGSS_ATB_REPLICATOR_DEVTYPE" offset="0x11FCC" width="32" description="">
		<bitfield id="ATB_REPLICATOR_PIDR4" width="32" begin="31" end="0" resetval="0x4" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_PIDR4" acronym="DEBUGSS_ATB_REPLICATOR_PIDR4" offset="0x11FD0" width="32" description="">
		<bitfield id="ATB_REPLICATOR_RESERVED1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_RESERVED1" acronym="DEBUGSS_ATB_REPLICATOR_RESERVED1" offset="0x11FD4" width="32" description="">
		<bitfield id="ATB_REPLICATOR_RESERVED2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_RESERVED2" acronym="DEBUGSS_ATB_REPLICATOR_RESERVED2" offset="0x11FD8" width="32" description="">
		<bitfield id="ATB_REPLICATOR_RESERVED3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_RESERVED3" acronym="DEBUGSS_ATB_REPLICATOR_RESERVED3" offset="0x11FDC" width="32" description="">
		<bitfield id="ATB_REPLICATOR_PIDR0" width="32" begin="31" end="0" resetval="0x9" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_PIDR0" acronym="DEBUGSS_ATB_REPLICATOR_PIDR0" offset="0x11FE0" width="32" description="">
		<bitfield id="ATB_REPLICATOR_PIDR1" width="32" begin="31" end="0" resetval="0x185" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_PIDR1" acronym="DEBUGSS_ATB_REPLICATOR_PIDR1" offset="0x11FE4" width="32" description="">
		<bitfield id="ATB_REPLICATOR_PIDR2" width="32" begin="31" end="0" resetval="0x27" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
