IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_ATB_REPLICATOR_PIDR2" acronym="DEBUGSS_ATB_REPLICATOR_PIDR2" offset="0x11FE8" width="32" description="">
		<bitfield id="ATB_REPLICATOR_PIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_PIDR3" acronym="DEBUGSS_ATB_REPLICATOR_PIDR3" offset="0x11FEC" width="32" description="">
		<bitfield id="ATB_REPLICATOR_CIDR0" width="32" begin="31" end="0" resetval="0x13" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_CIDR0" acronym="DEBUGSS_ATB_REPLICATOR_CIDR0" offset="0x11FF0" width="32" description="">
		<bitfield id="ATB_REPLICATOR_CIDR1" width="32" begin="31" end="0" resetval="0x144" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_CIDR1" acronym="DEBUGSS_ATB_REPLICATOR_CIDR1" offset="0x11FF4" width="32" description="">
		<bitfield id="ATB_REPLICATOR_CIDR2" width="32" begin="31" end="0" resetval="0x5" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_CIDR2" acronym="DEBUGSS_ATB_REPLICATOR_CIDR2" offset="0x11FF8" width="32" description="">
		<bitfield id="ATB_REPLICATOR_CIDR3" width="32" begin="31" end="0" resetval="0x177" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ATB_REPLICATOR_CIDR3" acronym="DEBUGSS_ATB_REPLICATOR_CIDR3" offset="0x11FFC" width="32" description="">
		<bitfield id="ETB_RDP" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDIEIAJ.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDDBEHG.html" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_RDP" acronym="DEBUGSS_ETB_RDP" offset="0x12004" width="32" description="">
		<bitfield id="ETB_STS" width="32" begin="31" end="0" resetval="0x8" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_STS" acronym="DEBUGSS_ETB_STS" offset="0x1200C" width="32" description="">
		<bitfield id="ETB_RRD" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_RRD" acronym="DEBUGSS_ETB_RRD" offset="0x12010" width="32" description="">
		<bitfield id="ETB_RRP" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ETB_RRP" acronym="DEBUGSS_ETB_RRP" offset="0x12014" width="32" description="">
		<bitfield id="ETB_RWP" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ETB_RWP" acronym="DEBUGSS_ETB_RWP" offset="0x12018" width="32" description="">
		<bitfield id="ETB_TRG" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ETB_TRG" acronym="DEBUGSS_ETB_TRG" offset="0x1201C" width="32" description="">
		<bitfield id="ETB_CTL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ETB_CTL" acronym="DEBUGSS_ETB_CTL" offset="0x12020" width="32" description="">
		<bitfield id="ETB_RWD" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ETB_RWD" acronym="DEBUGSS_ETB_RWD" offset="0x12024" width="32" description="">
		<bitfield id="ETB_FFSR" width="32" begin="31" end="0" resetval="0x2" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_FFSR" acronym="DEBUGSS_ETB_FFSR" offset="0x12300" width="32" description="">
		<bitfield id="ETB_FFCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ETB_FFCR" acronym="DEBUGSS_ETB_FFCR" offset="0x12304" width="32" description="">
		<bitfield id="ETB_ITMISCOP0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ETB_ITMISCOP0" acronym="DEBUGSS_ETB_ITMISCOP0" offset="0x12EE0" width="32" description="">
		<bitfield id="ETB_ITTRFLINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ETB_ITTRFLINACK" acronym="DEBUGSS_ETB_ITTRFLINACK" offset="0x12EE4" width="32" description="">
		<bitfield id="ETB_ITTRFLIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_ITTRFLIN" acronym="DEBUGSS_ETB_ITTRFLIN" offset="0x12EE8" width="32" description="">
		<bitfield id="ETB_ITATBDATA0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_ITATBDATA0" acronym="DEBUGSS_ETB_ITATBDATA0" offset="0x12EEC" width="32" description="">
		<bitfield id="ETB_ITATBCTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ETB_ITATBCTR2" acronym="DEBUGSS_ETB_ITATBCTR2" offset="0x12EF0" width="32" description="">
		<bitfield id="ETB_ITATBCTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_ITATBCTR1" acronym="DEBUGSS_ETB_ITATBCTR1" offset="0x12EF4" width="32" description="">
		<bitfield id="ETB_ITATBCTR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_ITATBCTR0" acronym="DEBUGSS_ETB_ITATBCTR0" offset="0x12EF8" width="32" description="">
		<bitfield id="ETB_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ETB_ITCTRL" acronym="DEBUGSS_ETB_ITCTRL" offset="0x12F00" width="32" description="">
		<bitfield id="ETB_CLAIMSET" width="32" begin="31" end="0" resetval="0x15" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_ETB_CLAIMSET" acronym="DEBUGSS_ETB_CLAIMSET" offset="0x12FA0" width="32" description="">
		<bitfield id="ETB_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
