IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_ETB_CLAIMCLR" acronym="DEBUGSS_ETB_CLAIMCLR" offset="0x12FA4" width="32" description="">
		<bitfield id="ETB_LAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_ETB_LAR" acronym="DEBUGSS_ETB_LAR" offset="0x12FB0" width="32" description="">
		<bitfield id="ETB_LSR" width="32" begin="31" end="0" resetval="0x3" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_LSR" acronym="DEBUGSS_ETB_LSR" offset="0x12FB4" width="32" description="">
		<bitfield id="ETB_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_AUTHSTATUS" acronym="DEBUGSS_ETB_AUTHSTATUS" offset="0x12FB8" width="32" description="">
		<bitfield id="ETB_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_DEVID" acronym="DEBUGSS_ETB_DEVID" offset="0x12FC8" width="32" description="">
		<bitfield id="ETB_DEVTYPE" width="32" begin="31" end="0" resetval="0x33" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_DEVTYPE" acronym="DEBUGSS_ETB_DEVTYPE" offset="0x12FCC" width="32" description="">
		<bitfield id="ETB_PIDR4" width="32" begin="31" end="0" resetval="0x4" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_PIDR4" acronym="DEBUGSS_ETB_PIDR4" offset="0x12FD0" width="32" description="">
		<bitfield id="ETB_RESERVED4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_RESERVED4" acronym="DEBUGSS_ETB_RESERVED4" offset="0x12FD4" width="32" description="">
		<bitfield id="ETB_RESERVED5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_RESERVED5" acronym="DEBUGSS_ETB_RESERVED5" offset="0x12FD8" width="32" description="">
		<bitfield id="ETB_RESERVED6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_RESERVED6" acronym="DEBUGSS_ETB_RESERVED6" offset="0x12FDC" width="32" description="">
		<bitfield id="ETB_PIDR0" width="32" begin="31" end="0" resetval="0x7" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_PIDR0" acronym="DEBUGSS_ETB_PIDR0" offset="0x12FE0" width="32" description="">
		<bitfield id="ETB_PIDR1" width="32" begin="31" end="0" resetval="0x185" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_PIDR1" acronym="DEBUGSS_ETB_PIDR1" offset="0x12FE4" width="32" description="">
		<bitfield id="ETB_PIDR2" width="32" begin="31" end="0" resetval="0x59" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_PIDR2" acronym="DEBUGSS_ETB_PIDR2" offset="0x12FE8" width="32" description="">
		<bitfield id="ETB_PIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_PIDR3" acronym="DEBUGSS_ETB_PIDR3" offset="0x12FEC" width="32" description="">
		<bitfield id="ETB_CIDR0" width="32" begin="31" end="0" resetval="0x13" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_CIDR0" acronym="DEBUGSS_ETB_CIDR0" offset="0x12FF0" width="32" description="">
		<bitfield id="ETB_CIDR1" width="32" begin="31" end="0" resetval="0x144" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_CIDR1" acronym="DEBUGSS_ETB_CIDR1" offset="0x12FF4" width="32" description="">
		<bitfield id="ETB_CIDR2" width="32" begin="31" end="0" resetval="0x5" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_CIDR2" acronym="DEBUGSS_ETB_CIDR2" offset="0x12FF8" width="32" description="">
		<bitfield id="ETB_CIDR3" width="32" begin="31" end="0" resetval="0x177" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_ETB_CIDR3" acronym="DEBUGSS_ETB_CIDR3" offset="0x12FFC" width="32" description="">
		<bitfield id="STMDMASTARTR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMDMASTARTR" acronym="DEBUGSS_STMDMASTARTR" offset="0x13C04" width="32" description="">
		<bitfield id="STMDMASTOPR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMDMASTOPR" acronym="DEBUGSS_STMDMASTOPR" offset="0x13C08" width="32" description="">
		<bitfield id="STMDMASTATR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMDMASTATR" acronym="DEBUGSS_STMDMASTATR" offset="0x13C0C" width="8" description="">
		<bitfield id="SENS" width="2" begin="3" end="2" resetval="0x0" description="Determines the sensitivity of the DMA request to the current buffer level in the STM:0b00 Buffer is &#60;25% full.0b01 Buffer is &#60;50% full.0b10 Buffer is &#60;75% full.0b11 Buffer is &#60;100% full." range="3 - 2" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMDMACTLR" acronym="DEBUGSS_STMDMACTLR" offset="0x13C10" width="32" description="">
		<bitfield id="STMDMAIDR" width="32" begin="31" end="0" resetval="0x2" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMDMAIDR" acronym="DEBUGSS_STMDMAIDR" offset="0x13CFC" width="32" description="">
		<bitfield id="STMHEER" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMHEER" acronym="DEBUGSS_STMHEER" offset="0x13D00" width="32" description="">
		<bitfield id="STMHETER" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMHETER" acronym="DEBUGSS_STMHETER" offset="0x13D20" width="32" description="">
		<bitfield id="STMHEBSR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMHEBSR" acronym="DEBUGSS_STMHEBSR" offset="0x13D60" width="32" description="">
		<bitfield id="STMHEMCR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMHEMCR" acronym="DEBUGSS_STMHEMCR" offset="0x13D64" width="8" description="">
		<bitfield id="EXTMUX" width="8" begin="7" end="0" resetval="0x0" description="Specifies the value that the optional external multiplexing logic uses to select the hardware events to connectto the STM.The value of this register is output from the STM on the HEEXTMUX[7:0] signals. The behavior of themultiplexing logic is IMPLEMENTATION DEFINED.This field is reset to zero." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMHEEXTMUXR" acronym="DEBUGSS_STMHEEXTMUXR" offset="0x13D68" width="16" description="">
		<bitfield id="MASTER" width="16" begin="15" end="0" resetval="0x128" description="The STPv2 master number for the hardware event trace:0x80 Hardware events are associated with master ID 0x80." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMHEMASTR" acronym="DEBUGSS_STMHEMASTR" offset="0x13DF4" width="32" description="">
		<bitfield id="HEEXTMUXSIZE" width="3" begin="30" end="28" resetval="0x3" description="The size of the STMHEEXTMUXR.EXTMUX bit field:0b011 8 bits wide." range="30 - 28" rwaccess="RO"/> 
		<bitfield id="NUMHE" width="9" begin="23" end="15" resetval="0x64" description="The number of hardware events supported by the STM:0b001000000 64 hardware events." range="23 - 15" rwaccess="RO"/> 
		<bitfield id="HECOMP" width="2" begin="5" end="4" resetval="0x3" description="Data compression on hardware event tracing support:0b11 Programmable data compression support. The STM implements theSTMHEMCR.COMPEN bit." range="5 - 4" rwaccess="RO"/> 
		<bitfield id="HEMASTR" width="1" begin="3" end="3" resetval="0x0" description="Specifies the STMHEMASTR support:0b0 The STMHEMASTR is read-only." range="3" rwaccess="RO"/> 
		<bitfield id="HEERR" width="1" begin="2" end="2" resetval="0x1" description="Hardware event error detection support:0b1 Implemented. The STM implements the STMHEMCR.ERRDETECT bit." range="2" rwaccess="RO"/> 
		<bitfield id="HETER" width="1" begin="0" end="0" resetval="0x1" description="Specifies the STMHETER support:0b1 Implemented." range="0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMHEFEAT1R" acronym="DEBUGSS_STMHEFEAT1R" offset="0x13DF8" width="16" description="">
		<bitfield id="VENDSPEC" width="4" begin="11" end="8" resetval="0x0" description="Identifies vendor-specific modifications or mappings:0b0000 Vendor-specific information." range="11 - 8" rwaccess="RO"/> 
		<bitfield id="CLASSREV" width="4" begin="7" end="4" resetval="0x1" description="Identifies the revision of the programmers model:0b0001 Revision." range="7 - 4" rwaccess="RO"/> 
		<bitfield id="CLASS" width="4" begin="3" end="0" resetval="0x1" description="Identifies the programmers model:0b0001 Hardware event control." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMHEIDR" acronym="DEBUGSS_STMHEIDR" offset="0x13DFC" width="32" description="">
		<bitfield id="STMSPER" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMSPER" acronym="DEBUGSS_STMSPER" offset="0x13E00" width="32" description="">
		<bitfield id="STMSPTER" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMSPTER" acronym="DEBUGSS_STMSPTER" offset="0x13E20" width="32" description="">
		<bitfield id="STMSPSCR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
