IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_STMSPSCR" acronym="DEBUGSS_STMSPSCR" offset="0x13E60" width="32" description="">
		<bitfield id="STMSPMSCR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMSPMSCR" acronym="DEBUGSS_STMSPMSCR" offset="0x13E64" width="32" description="">
		<bitfield id="STMSPOVERRIDER" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMSPOVERRIDER" acronym="DEBUGSS_STMSPOVERRIDER" offset="0x13E68" width="32" description="">
		<bitfield id="STMSPMOVERRIDER" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMSPMOVERRIDER" acronym="DEBUGSS_STMSPMOVERRIDER" offset="0x13E6C" width="32" description="">
		<bitfield id="STMSPTRIGCSR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMSPTRIGCSR" acronym="DEBUGSS_STMSPTRIGCSR" offset="0x13E70" width="24" description="">
		<bitfield id="BUSY" width="1" begin="23" end="23" resetval="0x0" description="Indicates whether the STM is busy, for example the STM trace FIFO is not empty:0b0 Not busy.0b1 Busy." range="23" rwaccess="RW"/> 
		<bitfield id="TRACEID" width="7" begin="22" end="16" resetval="0x0" description="ATB trace ID. Setting this value to all zeroes or to a value greater than 0x6F might result in UNPREDICTABLEtracing. Reset value of this bit field is UNKNOWN." range="22 - 16" rwaccess="RW"/> 
		<bitfield id="COMPEN" width="1" begin="5" end="5" resetval="0x0" description="Compression enable for stimulus ports:0b0 Disabled, the STM transmits data transfers based on the size of the transaction.0b1 Enabled, the STM compresses data transfers to save bandwidth." range="5" rwaccess="RW"/> 
		<bitfield id="SYNCEN" width="1" begin="2" end="2" resetval="0x0" description="The STM implements the STMSYNCR, so this bit is Read As One.0b1 The STM implements the STMSYNCR." range="2" rwaccess="RW"/> 
		<bitfield id="TSEN" width="1" begin="1" end="1" resetval="0x0" description="Determines whether to ignore timestamp requests:0b0 Disable timestamping. The STM ignores requests for timestamp generation, and treatsstimulus port writes that select timestamping as if timestamping were not selected.0b1 Enable timestamping. If stimulus writes select timestamping, the STM outputs a timestampaccording to STPv2." range="1" rwaccess="RW"/> 
		<bitfield id="EN" width="1" begin="0" end="0" resetval="0x0" description="Global STM enable:0b0 Disabled0b1 Enabled." range="0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMTCSR" acronym="DEBUGSS_STMTCSR" offset="0x13E80" width="32" description="">
		<bitfield id="STMTSSTIMR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMTSSTIMR" acronym="DEBUGSS_STMTSSTIMR" offset="0x13E84" width="32" description="">
		<bitfield id="STMTSFREQR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMTSFREQR" acronym="DEBUGSS_STMTSFREQR" offset="0x13E8C" width="32" description="">
		<bitfield id="STMSYNCR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMSYNCR" acronym="DEBUGSS_STMSYNCR" offset="0x13E90" width="8" description="">
		<bitfield id="QHWEVOVERRIDE" width="1" begin="7" end="7" resetval="0x0" description="Low-power interface override when hardware event tracing is enabled:0b0 The STM can accept a quiescence request on the STM low-power interface whenthe STMHEMCR.EN bit is set to 0b1.0b1 If the STMHEMCR.EN bit is set to 0b1, all quiescence requests on the STMlow-power interface are denied.Reset value is 0b0." range="7" rwaccess="RW"/> 
		<bitfield id="PRIORINVDIS" width="1" begin="2" end="2" resetval="0x0" description="Controls arbitration between the AXI interface and the hardware event observation interface duringflush:0b0 Priority inversion. When the AXI flush completes, the hardware event observationinterface gets priority until the hardware event observation interface flushcompletes.0b1 Priority inversion disabled. The AXI always has priority over the hardware eventobservation interface.Reset value is 0b0." range="2" rwaccess="RW"/> 
		<bitfield id="ASYNCPE" width="1" begin="1" end="1" resetval="0x0" description="ASYNC priority:0b0 Always lower than trace.0b1 Escalates on second synchronization request.Reset value is 0b0." range="1" rwaccess="RW"/> 
		<bitfield id="FIFOAF" width="1" begin="0" end="0" resetval="0x0" description="Auto-flush:0b0 Disabled.0b1 Enabled. The STM automatically drains all data even if the ATB interface is notfully utilized.Reset value is 0b0." range="0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMAUXCR" acronym="DEBUGSS_STMAUXCR" offset="0x13E94" width="24" description="">
		<bitfield id="SWOEN" width="2" begin="23" end="22" resetval="0x1" description="Specifies the STMTCSR.SWOEN bit support:0b01 Not implemented." range="23 - 22" rwaccess="RO"/> 
		<bitfield id="SYNCEN" width="2" begin="21" end="20" resetval="0x2" description="Specifies the STMTCSR.SYNCEN bit support:0b10 Implemented but always reads as 0b1." range="21 - 20" rwaccess="RO"/> 
		<bitfield id="HWTEN" width="2" begin="19" end="18" resetval="0x1" description="Specifies the STMTCSR.HWTEN bit support:0b01 Not implemented." range="19 - 18" rwaccess="RO"/> 
		<bitfield id="TSPRESCALE" width="2" begin="17" end="16" resetval="0x1" description="Timestamp prescale support:0b01 Not implemented." range="17 - 16" rwaccess="RO"/> 
		<bitfield id="TRIGCTL" width="2" begin="15" end="14" resetval="0x2" description="Trigger control support:0b10 Multi-shot and single-shot triggers supported, the STM implements the STMTRIGCSR." range="15 - 14" rwaccess="RO"/> 
		<bitfield id="TRACEBUS" width="4" begin="13" end="10" resetval="0x1" description="Trace bus support:0b0001 CoreSight ATB plus ATB trigger support implemented, the STM implements theSTMTCSR.TRACEID and STMTRIGCSR.ATBTRIGEN bit fields." range="13 - 10" rwaccess="RO"/> 
		<bitfield id="SYNC" width="2" begin="9" end="8" resetval="0x3" description="Specifies the STMSYNCR support:0b11 Implemented with MODE control." range="9 - 8" rwaccess="RO"/> 
		<bitfield id="FORCETS" width="1" begin="7" end="7" resetval="0x1" description="Specifies the STMTSSTIMR support:0b1 The STM implements the STMTSSTIMR.FORCETS bit." range="7" rwaccess="RO"/> 
		<bitfield id="TSFREQ" width="1" begin="6" end="6" resetval="0x1" description="Timestamp frequency indication configuration:0b1 The STMTSFREQR is read-write." range="6" rwaccess="RO"/> 
		<bitfield id="TS" width="2" begin="5" end="4" resetval="0x1" description="Timestamp support:0b01 Absolute timestamps implemented." range="5 - 4" rwaccess="RO"/> 
		<bitfield id="PROT" width="4" begin="3" end="0" resetval="0x1" description="Protocol:0b0001 STPv2 protocol." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMFEAT1R" acronym="DEBUGSS_STMFEAT1R" offset="0x13EA0" width="24" description="">
		<bitfield id="SPTYPE" width="2" begin="17" end="16" resetval="0x1" description="Stimulus port type support:0b01 Only extended stimulus ports." range="17 - 16" rwaccess="RO"/> 
		<bitfield id="DSIZE" width="4" begin="15" end="12" resetval="0x1" description="Fundamental data size:0b0001 64-bit data." range="15 - 12" rwaccess="RO"/> 
		<bitfield id="SPTRTYPE" width="2" begin="10" end="9" resetval="0x2" description="Stimulus port transaction type support:0b10 Both invariant timing and guaranteed transactions." range="10 - 9" rwaccess="RO"/> 
		<bitfield id="PRIVMASK" width="2" begin="8" end="7" resetval="0x1" description="Specifies the STMPRIVMASKR support:0b01 Not implemented." range="8 - 7" rwaccess="RO"/> 
		<bitfield id="SPOVERRIDE" width="1" begin="6" end="6" resetval="0x1" description="Specifies the STMSPOVERRIDER support:0b1 STMSPOVERRIDER and STMSPMOVERRIDER implemented." range="6" rwaccess="RO"/> 
		<bitfield id="SPCOMP" width="2" begin="5" end="4" resetval="0x3" description="Data compression on stimulus ports support:0b11 Data compression support is programmable, the STM implements theSTMTCSR.COMPEN bit." range="5 - 4" rwaccess="RO"/> 
		<bitfield id="SPER" width="1" begin="2" end="2" resetval="0x0" description="Specifies the STMSPER presence:0b0 Implemented." range="2" rwaccess="RO"/> 
		<bitfield id="SPTER" width="2" begin="1" end="0" resetval="0x2" description="Specifies the STMSPTER support:0b10 Implemented." range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMFEAT2R" acronym="DEBUGSS_STMFEAT2R" offset="0x13EA4" width="8" description="">
		<bitfield id="NUMMAST" width="7" begin="6" end="0" resetval="0x127" description="The number of stimulus port masters implemented minus 1:0b1111111 128 ports." range="6 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMFEAT3R" acronym="DEBUGSS_STMFEAT3R" offset="0x13EA8" width="8" description="">
		<bitfield id="ASYNCOUT_W" width="1" begin="3" end="3" resetval="0x0" description="Sets the value of the ASYNCOUT output signal in integration mode:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="3" rwaccess="WO"/> 
		<bitfield id="TRIGOUTHETE_W" width="1" begin="2" end="2" resetval="0x0" description="Sets the value of the TRIGOUTHETE output signal in integration mode:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="2" rwaccess="WO"/> 
		<bitfield id="TRIGOUTSW_W" width="1" begin="1" end="1" resetval="0x0" description="Sets the value of the TRIGOUTSW output signal in integration mode:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="1" rwaccess="WO"/> 
		<bitfield id="TRIGOUTSPTE_W" width="1" begin="0" end="0" resetval="0x0" description="Sets the value of the TRIGOUTSPTE output signal in integration mode:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMITTRIGGER" acronym="DEBUGSS_STMITTRIGGER" offset="0x13EE8" width="8" description="">
		<bitfield id="ATDATAM63_W" width="1" begin="8" end="8" resetval="0x0" description="Sets the value of the ATDATAM[63] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="8" rwaccess="WO"/> 
		<bitfield id="ATDATAM55_W" width="1" begin="7" end="7" resetval="0x0" description="Sets the value of the ATDATAM[55] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="7" rwaccess="WO"/> 
		<bitfield id="ATDATAM47_W" width="1" begin="6" end="6" resetval="0x0" description="Sets the value of the ATDATAM[47] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="6" rwaccess="WO"/> 
		<bitfield id="ATDATAM39_W" width="1" begin="5" end="5" resetval="0x0" description="Sets the value of the ATDATAM[39] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="5" rwaccess="WO"/> 
		<bitfield id="ATDATAM31_W" width="1" begin="4" end="4" resetval="0x0" description="Sets the value of the ATDATAM[31] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="4" rwaccess="WO"/> 
		<bitfield id="ATDATAM23_W" width="1" begin="3" end="3" resetval="0x0" description="Sets the value of the ATDATAM[23] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="3" rwaccess="WO"/> 
		<bitfield id="ATDATAM15_W" width="1" begin="2" end="2" resetval="0x0" description="Sets the value of the ATDATAM[15] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="2" rwaccess="WO"/> 
		<bitfield id="ATDATAM7_W" width="1" begin="1" end="1" resetval="0x0" description="Sets the value of the ATDATAM[7] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="1" rwaccess="WO"/> 
		<bitfield id="ATDATAM0_W" width="1" begin="0" end="0" resetval="0x0" description="Sets the value of the ATDATAM[0] output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMITATBDATA0" acronym="DEBUGSS_STMITATBDATA0" offset="0x13EEC" width="8" description="">
		<bitfield id="AFVALIDM_R" width="1" begin="1" end="1" resetval="0x0" description="Reads the value of the AFVALIDM input signal:0b1 The signal is at logic 0b1.0b0 The signal is at logic 0b0." range="1" rwaccess="RO"/> 
		<bitfield id="ATREADYM_R" width="1" begin="0" end="0" resetval="0x0" description="Reads the value of the ATREADYM input signal:0b1 The signal is at logic 0b1.0b0 The signal is at logic 0b0." range="0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMITATBCTR2" acronym="DEBUGSS_STMITATBCTR2" offset="0x13EF0" width="8" description="">
		<bitfield id="ATIDM_W" width="7" begin="6" end="0" resetval="0x0" description="Sets the value of the ATIDM output signal." range="6 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMITATBID" acronym="DEBUGSS_STMITATBID" offset="0x13EF4" width="16" description="">
		<bitfield id="ATBYTESM_W" width="3" begin="10" end="8" resetval="0x0" description="Sets the value of the ATBYTESM output signal:0b111 Drive logic 0b111.0b110 Drive logic 0b110.0b101 Drive logic 0b101.0b100 Drive logic 0b100.0b011 Drive logic 0b011.0b010 Drive logic 0b010.0b001 Drive logic 0b001.0b000 Drive logic 0b000." range="10 - 8" rwaccess="WO"/> 
		<bitfield id="AFREADYM_W" width="1" begin="1" end="1" resetval="0x0" description="Sets the value of the AFREADYM output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="1" rwaccess="WO"/> 
		<bitfield id="ATVALIDM_W" width="1" begin="0" end="0" resetval="0x0" description="Sets the value of the ATVALIDM output signal:0b1 Drive logic 0b1.0b0 Drive logic 0b0." range="0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMITATBCTR0" acronym="DEBUGSS_STMITATBCTR0" offset="0x13EF8" width="0" description="">
		<bitfield id="IME" width="1" begin="0" end="0" resetval="0x0" description="Enables the component to switch between functional and integration mode.0b1 Enable integration mode.0b0 Disable integration mode." range="0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMITCTRL" acronym="DEBUGSS_STMITCTRL" offset="0x13F00" width="32" description="">
		<bitfield id="STMCLAIMSET" width="32" begin="31" end="0" resetval="0x15" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STMCLAIMSET" acronym="DEBUGSS_STMCLAIMSET" offset="0x13FA0" width="32" description="">
		<bitfield id="STMCLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="ARM? System Trace Macrocell Programmers? ModelArchitecture Specification" range="31 - 0" rwaccess="RW"/>
	</register>
