IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_STMCLAIMCLR" acronym="DEBUGSS_STMCLAIMCLR" offset="0x13FA4" width="32" description="">
		<bitfield id="KEY" width="32" begin="31" end="0" resetval="0x0" description="Ignores writes when the PADDRDBG31 signal is HIGH.When the PADDRDBG31 signal is LOW, a write of 0xC5ACCE55 unlocks the lock control mechanism, enablingfurther writes with the PADDRDBG31 signal LOW.Other values lock the lock control mechanism, preventing further writes with the PADDRDBG31 signal LOW,except to the STMLAR." range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMLAR" acronym="DEBUGSS_STMLAR" offset="0x13FB0" width="8" description="">
		<bitfield id="NTT" width="1" begin="2" end="2" resetval="0x0" description="Indicates whether the component implements the STMLAR as 8 bit or 32 bit.0b0 32 bit." range="2" rwaccess="WO"/> 
		<bitfield id="SLK" width="1" begin="1" end="1" resetval="0x0" description="Returns the current status of the lock.0b0 Enables write access to the STM. For read accesses to the STMLSR when the PADDRDBG31signal is HIGH, this bit is always 0b0.0b1 Blocks write access to the STM. The STM ignores all write accesses to the registers when thePADDRDBG31 signal is LOW. Reads are permitted" range="1" rwaccess="WO"/> 
		<bitfield id="SLI" width="1" begin="0" end="0" resetval="0x0" description="Indicates that a lock control mechanism exists for the device.0b0 No lock control mechanism exists. The STM ignores writes to the STMLAR. For read accessesto the STMLSR when the PADDRDBG31 signal is HIGH, this bit is always 0b0.0b1 Lock control mechanism is present. For read accesses to the STMLSR when the PADDRDBG31signal is LOW, this bit is always 0b1." range="0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STMLSR" acronym="DEBUGSS_STMLSR" offset="0x13FB4" width="8" description="">
		<bitfield id="SNID" width="2" begin="7" end="6" resetval="0x2" description="Indicates the security level for Secure non-invasive debug:0b10 Disabled.0b11 Enabled." range="7 - 6" rwaccess="RO"/> 
		<bitfield id="SID" width="2" begin="5" end="4" resetval="0x2" description="Indicates the security level for Secure invasive debug:0b10 Disabled.0b11 Enabled." range="5 - 4" rwaccess="RO"/> 
		<bitfield id="NSNID" width="2" begin="3" end="2" resetval="0x2" description="Indicates the security level for Non-secure non-invasive debug:0b10 Disabled.0b11 Enabled." range="3 - 2" rwaccess="RO"/> 
		<bitfield id="NSID" width="2" begin="1" end="0" resetval="0x2" description="Indicates the security level for Non-secure invasive debug:0b10 Disabled.0b11 Enabled." range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMAUTHSTATUS" acronym="DEBUGSS_STMAUTHSTATUS" offset="0x13FB8" width="32" description="">
		<bitfield id="ARCHITECT" width="11" begin="31" end="21" resetval="0x571" description="Defines the architect of the component:Bits[31:28] Indicates the JEP106 continuation code.Bits[27:21] Indicates the JEP106 identification code.See the Standard Manufacturer?s Identification Code for information about JEP106. For the STM-500,ARM is the architect, and this 11-bit field returns 0x23B." range="31 - 21" rwaccess="RO"/> 
		<bitfield id="PRESENT" width="1" begin="20" end="20" resetval="0x1" description="Indicates the presence of the STMDEVARCH register:0b1 The STMDEVARCH register is present." range="20" rwaccess="RO"/> 
		<bitfield id="REVISION" width="4" begin="19" end="16" resetval="0x1" description="Architecture revision. Returns the revision of the architecture that the ARCHID field specifies. For theSTM, this value is 0x1, indicating the STMv1.1 architecture." range="19 - 16" rwaccess="RO"/> 
		<bitfield id="ARCHID" width="16" begin="15" end="0" resetval="0x2659" description="Architecture ID. Returns a value that identifies the architecture of the component. For the STM, this valueis 0x0A63, indicating the STMv1.1 architecture." range="15 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMDEVARCH" acronym="DEBUGSS_STMDEVARCH" offset="0x13FBC" width="16" description="">
		<bitfield id="NUMSP" width="17" begin="16" end="0" resetval="0x65536" description="Indicates the number of stimulus ports implemented.0x10000    65536" range="16 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMDEVID" acronym="DEBUGSS_STMDEVID" offset="0x13FC8" width="8" description="">
		<bitfield id="SUB" width="4" begin="7" end="4" resetval="0x6" description="Sub-classification within the major category:0b0110 The component generates trace based on software and hardware stimulus" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="4" begin="3" end="0" resetval="0x3" description="Major classification grouping for the debug or trace component:0b0011 The component is a trace source." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMDEVTYPE" acronym="DEBUGSS_STMDEVTYPE" offset="0x13FCC" width="8" description="">
		<bitfield id="SIZE" width="4" begin="7" end="4" resetval="0x0" description="This 4-bit value indicates the total contiguous size of the memory window used by the component in powers oftwo from the standard 4KB. If a component only requires the standard 4KB, this bit field must read as 0x0, 4KBonly. For 8KB set to 0x1, for 16KB set to 0x2, for 32KB set to 0x3, and so on.0x0 The device only occupies 4KB of memory." range="7 - 4" rwaccess="RO"/> 
		<bitfield id="DES_2" width="4" begin="3" end="0" resetval="0x4" description="JEDEC continuation code indicating the designer of the component, together with the identity code.0x4 ARM JEDEC identity code is on the fifth bank." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMPIDR4" acronym="DEBUGSS_STMPIDR4" offset="0x13FD0" width="8" description="">
		<bitfield id="PART_0" width="8" begin="7" end="0" resetval="0x99" description="Bits [7:0] of the component part number, specified by the designer of the component.0b01100011 Lowest eight bits of the part number, 0x963." range="7 - 0" rwaccess="RO"/>
	</register>
