IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_STMPIDR0" acronym="DEBUGSS_STMPIDR0" offset="0x13FE0" width="8" description="">
		<bitfield id="DES_0" width="4" begin="7" end="4" resetval="0x11" description="Bits [3:0] of the JEDEC identity code indicating the designer of the component, together with the continuationcode.0b1011 Lowest four bits of the JEP106 identity code." range="7 - 4" rwaccess="RO"/> 
		<bitfield id="PART_1" width="4" begin="3" end="0" resetval="0x9" description="Bits [11:8] of the component part number, specified by the designer of the component.0b1001 Upper four bits of the part number, 0x963." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMPIDR1" acronym="DEBUGSS_STMPIDR1" offset="0x13FE4" width="8" description="">
		<bitfield id="REVISION" width="4" begin="7" end="4" resetval="0x0" description="An incremental value starting at 0x0 for the first design of this component. The value increases by one for bothmajor and minor revisions and is used as a look-up to establish the exact major and minor revision.0b0000 The device is at r0p0" range="7 - 4" rwaccess="RO"/> 
		<bitfield id="JEDEC" width="1" begin="3" end="3" resetval="0x1" description="Indicates the use of a JEDEC assigned value. This bit is always set.0b1 The designer ID is specified by JEDEC (http://www.jedec.org)." range="3" rwaccess="RO"/> 
		<bitfield id="DES_1" width="3" begin="2" end="0" resetval="0x3" description="Bits [6:4] of the JEDEC identity code indicating the designer of the component, together with the continuationcode.0b011 Upper three bits of the JEP106 identity code" range="2 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMPIDR2" acronym="DEBUGSS_STMPIDR2" offset="0x13FE8" width="8" description="">
		<bitfield id="REVAND" width="4" begin="7" end="4" resetval="0x0" description="Indicates minor errata fixes specific to the design, for example metal fixes after implementation. In most casesthis field is zero. ARM recommends that the component designers ensure that the bit field can be changed by ametal fix if required, for example by driving the bit field from registers that reset to zero.0x0 No metal fixes in the component." range="7 - 4" rwaccess="RO"/> 
		<bitfield id="CMOD" width="4" begin="3" end="0" resetval="0x0" description="Where the component is reusable IP, this value indicates whether the customer has modified the behavior of thecomponent. In most cases this field is zero.0x0 No modifications made." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMPIDR3" acronym="DEBUGSS_STMPIDR3" offset="0x13FEC" width="8" description="">
		<bitfield id="PRMBL_0" width="8" begin="7" end="0" resetval="0x13" description="Contains bits [31:21] of the component identification.0x0D Identification value." range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMCIDR0" acronym="DEBUGSS_STMCIDR0" offset="0x13FF0" width="8" description="">
		<bitfield id="CLASS" width="4" begin="7" end="4" resetval="0x9" description="Class of the component, for example, the ROM table or CoreSight component.0x9 Indicates the component is a CoreSight component." range="7 - 4" rwaccess="RO"/> 
		<bitfield id="PRMBL_1" width="4" begin="3" end="0" resetval="0x0" description="Contains bits [19:16] of the component identification.0x0 Identification value." range="3 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMCIDR1" acronym="DEBUGSS_STMCIDR1" offset="0x13FF4" width="8" description="">
		<bitfield id="PRMBL_2" width="8" begin="7" end="0" resetval="0x5" description="Contains bits [15:8] of the component identification.0x05 Identification value." range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMCIDR2" acronym="DEBUGSS_STMCIDR2" offset="0x13FF8" width="8" description="">
		<bitfield id="PRMBL_3" width="8" begin="7" end="0" resetval="0x177" description="Contains bits [7:0] of the component identification.0xB1 Identification value." range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STMCIDR3" acronym="DEBUGSS_STMCIDR3" offset="0x13FFC" width="32" description="">
		<bitfield id="STM_CTI_CONTROL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_CONTROL" acronym="DEBUGSS_STM_CTI_CONTROL" offset="0x14000" width="32" description="">
		<bitfield id="STM_CTI_INTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INTACK" acronym="DEBUGSS_STM_CTI_INTACK" offset="0x14010" width="32" description="">
		<bitfield id="STM_CTI_APPSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_APPSET" acronym="DEBUGSS_STM_CTI_APPSET" offset="0x14014" width="32" description="">
		<bitfield id="STM_CTI_APPCLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_APPCLEAR" acronym="DEBUGSS_STM_CTI_APPCLEAR" offset="0x14018" width="32" description="">
		<bitfield id="STM_CTI_APPPULSE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_APPPULSE" acronym="DEBUGSS_STM_CTI_APPPULSE" offset="0x1401C" width="32" description="">
		<bitfield id="STM_CTI_INEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INEN0" acronym="DEBUGSS_STM_CTI_INEN0" offset="0x14020" width="32" description="">
		<bitfield id="STM_CTI_INEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INEN1" acronym="DEBUGSS_STM_CTI_INEN1" offset="0x14024" width="32" description="">
		<bitfield id="STM_CTI_INEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
