IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_STM_CTI_INEN2" acronym="DEBUGSS_STM_CTI_INEN2" offset="0x14028" width="32" description="">
		<bitfield id="STM_CTI_INEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INEN3" acronym="DEBUGSS_STM_CTI_INEN3" offset="0x1402C" width="32" description="">
		<bitfield id="STM_CTI_INEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INEN4" acronym="DEBUGSS_STM_CTI_INEN4" offset="0x14030" width="32" description="">
		<bitfield id="STM_CTI_INEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INEN5" acronym="DEBUGSS_STM_CTI_INEN5" offset="0x14034" width="32" description="">
		<bitfield id="STM_CTI_INEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INEN6" acronym="DEBUGSS_STM_CTI_INEN6" offset="0x14038" width="32" description="">
		<bitfield id="STM_CTI_INEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_INEN7" acronym="DEBUGSS_STM_CTI_INEN7" offset="0x1403C" width="32" description="">
		<bitfield id="STM_CTI_OUTEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN0" acronym="DEBUGSS_STM_CTI_OUTEN0" offset="0x140A0" width="32" description="">
		<bitfield id="STM_CTI_OUTEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN1" acronym="DEBUGSS_STM_CTI_OUTEN1" offset="0x140A4" width="32" description="">
		<bitfield id="STM_CTI_OUTEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN2" acronym="DEBUGSS_STM_CTI_OUTEN2" offset="0x140A8" width="32" description="">
		<bitfield id="STM_CTI_OUTEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN3" acronym="DEBUGSS_STM_CTI_OUTEN3" offset="0x140AC" width="32" description="">
		<bitfield id="STM_CTI_OUTEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN4" acronym="DEBUGSS_STM_CTI_OUTEN4" offset="0x140B0" width="32" description="">
		<bitfield id="STM_CTI_OUTEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN5" acronym="DEBUGSS_STM_CTI_OUTEN5" offset="0x140B4" width="32" description="">
		<bitfield id="STM_CTI_OUTEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN6" acronym="DEBUGSS_STM_CTI_OUTEN6" offset="0x140B8" width="32" description="">
		<bitfield id="STM_CTI_OUTEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_OUTEN7" acronym="DEBUGSS_STM_CTI_OUTEN7" offset="0x140BC" width="32" description="">
		<bitfield id="STM_CTI_TRIGINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_TRIGINSTATUS" acronym="DEBUGSS_STM_CTI_TRIGINSTATUS" offset="0x14130" width="32" description="">
		<bitfield id="STM_CTI_TRIGOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_TRIGOUTSTATUS" acronym="DEBUGSS_STM_CTI_TRIGOUTSTATUS" offset="0x14134" width="32" description="">
		<bitfield id="STM_CTI_CHINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_CHINSTATUS" acronym="DEBUGSS_STM_CTI_CHINSTATUS" offset="0x14138" width="32" description="">
		<bitfield id="STM_CTI_CHOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_CHOUTSTATUS" acronym="DEBUGSS_STM_CTI_CHOUTSTATUS" offset="0x1413C" width="32" description="">
		<bitfield id="STM_CTI_GATE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_GATE" acronym="DEBUGSS_STM_CTI_GATE" offset="0x14140" width="32" description="">
		<bitfield id="STM_CTI_ASICCTL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ASICCTL" acronym="DEBUGSS_STM_CTI_ASICCTL" offset="0x14144" width="32" description="">
		<bitfield id="STM_CTI_ITCHINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITCHINACK" acronym="DEBUGSS_STM_CTI_ITCHINACK" offset="0x14EDC" width="32" description="">
		<bitfield id="STM_CTI_ITTRIGINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITTRIGINACK" acronym="DEBUGSS_STM_CTI_ITTRIGINACK" offset="0x14EE0" width="32" description="">
		<bitfield id="STM_CTI_ITCHOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITCHOUT" acronym="DEBUGSS_STM_CTI_ITCHOUT" offset="0x14EE4" width="32" description="">
		<bitfield id="STM_CTI_ITTRIGOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITTRIGOUT" acronym="DEBUGSS_STM_CTI_ITTRIGOUT" offset="0x14EE8" width="32" description="">
		<bitfield id="STM_CTI_ITCHOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
