IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_STM_CTI_ITCHOUTACK" acronym="DEBUGSS_STM_CTI_ITCHOUTACK" offset="0x14EEC" width="32" description="">
		<bitfield id="STM_CTI_ITTRIGOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITTRIGOUTACK" acronym="DEBUGSS_STM_CTI_ITTRIGOUTACK" offset="0x14EF0" width="32" description="">
		<bitfield id="STM_CTI_ITCHIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITCHIN" acronym="DEBUGSS_STM_CTI_ITCHIN" offset="0x14EF4" width="32" description="">
		<bitfield id="STM_CTI_ITTRIGIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITTRIGIN" acronym="DEBUGSS_STM_CTI_ITTRIGIN" offset="0x14EF8" width="32" description="">
		<bitfield id="STM_CTI_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_ITCTRL" acronym="DEBUGSS_STM_CTI_ITCTRL" offset="0x14F00" width="32" description="">
		<bitfield id="STM_CTI_CLAIM_TAG_SET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_CLAIM_TAG_SET" acronym="DEBUGSS_STM_CTI_CLAIM_TAG_SET" offset="0x14FA0" width="32" description="">
		<bitfield id="STM_CTI_CLAIM_TAG_CLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_STM_CTI_CLAIM_TAG_CLEAR" acronym="DEBUGSS_STM_CTI_CLAIM_TAG_CLEAR" offset="0x14FA4" width="32" description="">
		<bitfield id="STM_CTI_LOCK_ACCESS_REGISTER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_LOCK_ACCESS_REGISTER" acronym="DEBUGSS_STM_CTI_LOCK_ACCESS_REGISTER" offset="0x14FB0" width="32" description="">
		<bitfield id="STM_CTI_LOCK_STATUS_REGISTER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_LOCK_STATUS_REGISTER" acronym="DEBUGSS_STM_CTI_LOCK_STATUS_REGISTER" offset="0x14FB4" width="32" description="">
		<bitfield id="STM_CTI_AUTHENTICATION_STATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_AUTHENTICATION_STATUS" acronym="DEBUGSS_STM_CTI_AUTHENTICATION_STATUS" offset="0x14FB8" width="32" description="">
		<bitfield id="STM_CTI_DEVICE_ID" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_DEVICE_ID" acronym="DEBUGSS_STM_CTI_DEVICE_ID" offset="0x14FC8" width="32" description="">
		<bitfield id="STM_CTI_DEVICE_TYPE_IDENTIFIER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_DEVICE_TYPE_IDENTIFIER" acronym="DEBUGSS_STM_CTI_DEVICE_TYPE_IDENTIFIER" offset="0x14FCC" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID4" acronym="DEBUGSS_STM_CTI_PERIPHERALID4" offset="0x14FD0" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID5" acronym="DEBUGSS_STM_CTI_PERIPHERALID5" offset="0x14FD4" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID6" acronym="DEBUGSS_STM_CTI_PERIPHERALID6" offset="0x14FD8" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID7" acronym="DEBUGSS_STM_CTI_PERIPHERALID7" offset="0x14FDC" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID0" acronym="DEBUGSS_STM_CTI_PERIPHERALID0" offset="0x14FE0" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID1" acronym="DEBUGSS_STM_CTI_PERIPHERALID1" offset="0x14FE4" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID2" acronym="DEBUGSS_STM_CTI_PERIPHERALID2" offset="0x14FE8" width="32" description="">
		<bitfield id="STM_CTI_PERIPHERALID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_PERIPHERALID3" acronym="DEBUGSS_STM_CTI_PERIPHERALID3" offset="0x14FEC" width="32" description="">
		<bitfield id="STM_CTI_COMPONENT_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_COMPONENT_ID0" acronym="DEBUGSS_STM_CTI_COMPONENT_ID0" offset="0x14FF0" width="32" description="">
		<bitfield id="STM_CTI_COMPONENT_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_COMPONENT_ID1" acronym="DEBUGSS_STM_CTI_COMPONENT_ID1" offset="0x14FF4" width="32" description="">
		<bitfield id="STM_CTI_COMPONENT_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
