IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_STM_CTI_COMPONENT_ID2" acronym="DEBUGSS_STM_CTI_COMPONENT_ID2" offset="0x14FF8" width="32" description="">
		<bitfield id="STM_CTI_COMPONENT_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_STM_CTI_COMPONENT_ID3" acronym="DEBUGSS_STM_CTI_COMPONENT_ID3" offset="0x14FFC" width="32" description="">
		<bitfield id="HSM_CM4_CTI_CONTROL" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDGDIHE.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDHBDIA.html" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_CONTROL" acronym="DEBUGSS_HSM_CM4_CTI_CONTROL" offset="0x15000" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INTACK" acronym="DEBUGSS_HSM_CM4_CTI_INTACK" offset="0x15010" width="32" description="">
		<bitfield id="HSM_CM4_CTI_APPSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_APPSET" acronym="DEBUGSS_HSM_CM4_CTI_APPSET" offset="0x15014" width="32" description="">
		<bitfield id="HSM_CM4_CTI_APPCLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_APPCLEAR" acronym="DEBUGSS_HSM_CM4_CTI_APPCLEAR" offset="0x15018" width="32" description="">
		<bitfield id="HSM_CM4_CTI_APPPULSE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_APPPULSE" acronym="DEBUGSS_HSM_CM4_CTI_APPPULSE" offset="0x1501C" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN0" acronym="DEBUGSS_HSM_CM4_CTI_INEN0" offset="0x15020" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN1" acronym="DEBUGSS_HSM_CM4_CTI_INEN1" offset="0x15024" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN2" acronym="DEBUGSS_HSM_CM4_CTI_INEN2" offset="0x15028" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN3" acronym="DEBUGSS_HSM_CM4_CTI_INEN3" offset="0x1502C" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN4" acronym="DEBUGSS_HSM_CM4_CTI_INEN4" offset="0x15030" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN5" acronym="DEBUGSS_HSM_CM4_CTI_INEN5" offset="0x15034" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN6" acronym="DEBUGSS_HSM_CM4_CTI_INEN6" offset="0x15038" width="32" description="">
		<bitfield id="HSM_CM4_CTI_INEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_INEN7" acronym="DEBUGSS_HSM_CM4_CTI_INEN7" offset="0x1503C" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_OUTEN0" acronym="DEBUGSS_HSM_CM4_CTI_OUTEN0" offset="0x150A0" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_OUTEN1" acronym="DEBUGSS_HSM_CM4_CTI_OUTEN1" offset="0x150A4" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_OUTEN2" acronym="DEBUGSS_HSM_CM4_CTI_OUTEN2" offset="0x150A8" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_OUTEN3" acronym="DEBUGSS_HSM_CM4_CTI_OUTEN3" offset="0x150AC" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_OUTEN4" acronym="DEBUGSS_HSM_CM4_CTI_OUTEN4" offset="0x150B0" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_OUTEN5" acronym="DEBUGSS_HSM_CM4_CTI_OUTEN5" offset="0x150B4" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_OUTEN6" acronym="DEBUGSS_HSM_CM4_CTI_OUTEN6" offset="0x150B8" width="32" description="">
		<bitfield id="HSM_CM4_CTI_OUTEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
