IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_HSM_CM4_CTI_DEVICE_TYPE_IDENTIFIER" acronym="DEBUGSS_HSM_CM4_CTI_DEVICE_TYPE_IDENTIFIER" offset="0x15FCC" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID4" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID4" offset="0x15FD0" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID5" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID5" offset="0x15FD4" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID6" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID6" offset="0x15FD8" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID7" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID7" offset="0x15FDC" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID0" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID0" offset="0x15FE0" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID1" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID1" offset="0x15FE4" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID2" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID2" offset="0x15FE8" width="32" description="">
		<bitfield id="HSM_CM4_CTI_PERIPHERALID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_PERIPHERALID3" acronym="DEBUGSS_HSM_CM4_CTI_PERIPHERALID3" offset="0x15FEC" width="32" description="">
		<bitfield id="HSM_CM4_CTI_COMPONENT_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID0" acronym="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID0" offset="0x15FF0" width="32" description="">
		<bitfield id="HSM_CM4_CTI_COMPONENT_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID1" acronym="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID1" offset="0x15FF4" width="32" description="">
		<bitfield id="HSM_CM4_CTI_COMPONENT_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID2" acronym="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID2" offset="0x15FF8" width="32" description="">
		<bitfield id="HSM_CM4_CTI_COMPONENT_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID3" acronym="DEBUGSS_HSM_CM4_CTI_COMPONENT_ID3" offset="0x15FFC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDIDR" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0363e/Cegejeeb.htmlDebug Identification Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_ROM" acronym="DEBUGSS_MSS_R5SS0_ROM" offset="0x20000" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWFAR" width="32" begin="31" end="0" resetval="0x0" description="Watchpoint Fault Address Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGDIDR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGDIDR" offset="0x30000" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGVCR" width="32" begin="31" end="0" resetval="0x0" description="Vector Catch Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWFAR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWFAR" offset="0x30018" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGECR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGVCR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGVCR" offset="0x3001C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDSCCR" width="32" begin="31" end="0" resetval="0x0" description="Debug State Cache Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGECR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGECR" offset="0x30024" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDTRRX" width="32" begin="31" end="0" resetval="0x0" description="Host to Target Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGDSCCR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGDSCCR" offset="0x30028" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGITR" width="32" begin="31" end="0" resetval="0x0" description="Instruction Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGDTRRX" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGDTRRX" offset="0x30080" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDSCR" width="32" begin="31" end="0" resetval="0x0" description="Debug Status and Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGITR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGITR" offset="0x30084" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDTRTX" width="32" begin="31" end="0" resetval="0x0" description="Target to Host Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
