IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGDSCR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGDSCR" offset="0x30088" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDRCR" width="32" begin="31" end="0" resetval="0x0" description="Debug Run Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGDTRTX" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGDTRTX" offset="0x3008C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR0" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGDRCR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGDRCR" offset="0x30090" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR1" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR0" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR0" offset="0x30100" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR2" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR1" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR1" offset="0x30104" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR3" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR2" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR2" offset="0x30108" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR4" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR3" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR3" offset="0x3010C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR5" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR4" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR4" offset="0x30110" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR6" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR5" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR5" offset="0x30114" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR7" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR6" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR6" offset="0x30118" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR0" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR7" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBVR7" offset="0x3011C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR1" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR0" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR0" offset="0x30140" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR2" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR1" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR1" offset="0x30144" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR3" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR2" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR2" offset="0x30148" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR4" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR3" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR3" offset="0x3014C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR5" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR4" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR4" offset="0x30150" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR6" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR5" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR5" offset="0x30154" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR7" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR6" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR6" offset="0x30158" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR0" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR7" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGBCR7" offset="0x3015C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR1" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR0" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR0" offset="0x30180" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR2" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
