IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR1" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR1" offset="0x30184" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR3" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR2" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR2" offset="0x30188" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR4" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR3" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR3" offset="0x3018C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR5" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR4" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR4" offset="0x30190" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR6" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR5" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR5" offset="0x30194" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR7" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR6" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR6" offset="0x30198" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR0" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR7" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWVR7" offset="0x3019C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR1" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR0" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR0" offset="0x301C0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR2" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR1" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR1" offset="0x301C4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR3" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR2" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR2" offset="0x301C8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR4" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR3" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR3" offset="0x301CC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR5" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR4" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR4" offset="0x301D0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR6" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR5" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR5" offset="0x301D4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWCR7" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR6" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR6" offset="0x301D8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGOSLAR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR7" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGWCR7" offset="0x301DC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGOSLSR" width="32" begin="31" end="0" resetval="0x0" description="Operating System Lock Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGOSLAR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGOSLAR" offset="0x30300" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGOSSRR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGOSLSR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGOSLSR" offset="0x30304" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGPRCR" width="32" begin="31" end="0" resetval="0x0" description="Device Power Down and Reset Control Regsiter" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGOSSRR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGOSSRR" offset="0x30308" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGPRSR" width="32" begin="31" end="0" resetval="0x0" description="Device Power Down and Reset Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGPRCR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGPRCR" offset="0x30310" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_MIDR" width="32" begin="31" end="0" resetval="0x0" description="Main ID Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_DBGPRSR" acronym="DEBUGSS_MSS_R5SS0_A_APB_DBGPRSR" offset="0x30314" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_CTR" width="32" begin="31" end="0" resetval="0x0" description="Cache Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_PROCID_MIDR" acronym="DEBUGSS_MSS_R5SS0_A_APB_PROCID_MIDR" offset="0x30D00" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_TCMTR" width="32" begin="31" end="0" resetval="0x0" description="TCM Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
