IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_APB_MR_CLAIMCLR" acronym="DEBUGSS_MSS_R5SS0_A_APB_MR_CLAIMCLR" offset="0x30FA4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_LOCKSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Lock Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_MR_LOCKACCESS" acronym="DEBUGSS_MSS_R5SS0_A_APB_MR_LOCKACCESS" offset="0x30FB0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Authentication Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_MR_LOCKSTATUS" acronym="DEBUGSS_MSS_R5SS0_A_APB_MR_LOCKSTATUS" offset="0x30FB4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Device Identifier" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_MR_AUTHSTATUS" acronym="DEBUGSS_MSS_R5SS0_A_APB_MR_AUTHSTATUS" offset="0x30FB8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_DEVTYPE" width="32" begin="31" end="0" resetval="0x0" description="Device Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_MR_DEVID" acronym="DEBUGSS_MSS_R5SS0_A_APB_MR_DEVID" offset="0x30FC8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_MR_DEVTYPE" acronym="DEBUGSS_MSS_R5SS0_A_APB_MR_DEVTYPE" offset="0x30FCC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID4" acronym="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID4" offset="0x30FD0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID0" acronym="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID0" offset="0x30FE0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID1" acronym="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID1" offset="0x30FE4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID2" acronym="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID2" offset="0x30FE8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID3" acronym="DEBUGSS_MSS_R5SS0_A_APB_PERIP_ID3" offset="0x30FEC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID0" acronym="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID0" offset="0x30FF0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID1" acronym="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID1" offset="0x30FF4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID2" acronym="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID2" offset="0x30FF8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDIDR" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0363e/Cegejeeb.htmlDebug Identification Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID3" acronym="DEBUGSS_MSS_R5SS0_A_APB_COMP_ID3" offset="0x30FFC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWFAR" width="32" begin="31" end="0" resetval="0x0" description="Watchpoint Fault Address Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGDIDR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGDIDR" offset="0x32000" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGVCR" width="32" begin="31" end="0" resetval="0x0" description="Vector Catch Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGWFAR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGWFAR" offset="0x32018" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGECR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGVCR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGVCR" offset="0x3201C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDSCCR" width="32" begin="31" end="0" resetval="0x0" description="Debug State Cache Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGECR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGECR" offset="0x32024" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDTRRX" width="32" begin="31" end="0" resetval="0x0" description="Host to Target Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGDSCCR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGDSCCR" offset="0x32028" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGITR" width="32" begin="31" end="0" resetval="0x0" description="Instruction Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGDTRRX" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGDTRRX" offset="0x32080" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDSCR" width="32" begin="31" end="0" resetval="0x0" description="Debug Status and Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGITR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGITR" offset="0x32084" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDTRTX" width="32" begin="31" end="0" resetval="0x0" description="Target to Host Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGDSCR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGDSCR" offset="0x32088" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGDRCR" width="32" begin="31" end="0" resetval="0x0" description="Debug Run Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
