IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGDTRTX" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGDTRTX" offset="0x3208C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR0" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGDRCR" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGDRCR" offset="0x32090" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR1" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR0" offset="0x32100" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR2" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR1" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR1" offset="0x32104" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR3" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR2" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR2" offset="0x32108" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR4" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR3" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR3" offset="0x3210C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR5" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR4" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR4" offset="0x32110" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR6" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR5" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR5" offset="0x32114" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBVR7" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR6" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR6" offset="0x32118" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR0" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR7" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBVR7" offset="0x3211C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR1" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR0" offset="0x32140" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR2" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR1" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR1" offset="0x32144" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR3" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR2" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR2" offset="0x32148" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR4" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR3" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR3" offset="0x3214C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR5" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR4" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR4" offset="0x32150" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR6" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR5" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR5" offset="0x32154" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGBCR7" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR6" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR6" offset="0x32158" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR0" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR7" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGBCR7" offset="0x3215C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR1" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR0" offset="0x32180" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR2" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR1" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR1" offset="0x32184" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR3" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR2" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR2" offset="0x32188" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR4" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR3" acronym="DEBUGSS_MSS_R5SS0_B_APB_DBGWVR3" offset="0x3218C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_DBGWVR5" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
