IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MPIDR" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MPIDR" offset="0x32D14" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_PFR1" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_PFR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_PFR0" offset="0x32D20" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_DFR0" width="32" begin="31" end="0" resetval="0x0" description="Debug Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_PFR1" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_PFR1" offset="0x32D24" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_AFR0" width="32" begin="31" end="0" resetval="0x0" description="Auxiliary Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_DFR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_DFR0" offset="0x32D28" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_MMFR0" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_AFR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_AFR0" offset="0x32D2C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_MMFR1" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR0" offset="0x32D30" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_MMFR2" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR1" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR1" offset="0x32D34" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_MMFR3" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR2" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR2" offset="0x32D38" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_ISAR0" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR3" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_MMFR3" offset="0x32D3C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_ISAR1" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR0" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR0" offset="0x32D40" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_ISAR2" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR1" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR1" offset="0x32D44" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_ISAR3" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR2" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR2" offset="0x32D48" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_ISAR4" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR3" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR3" offset="0x32D4C" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PROCID_ISAR5" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR4" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR4" offset="0x32D50" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Integration Mode Control Registers" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR5" acronym="DEBUGSS_MSS_R5SS0_B_APB_PROCID_ISAR5" offset="0x32D54" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_CLAIMSET" width="32" begin="31" end="0" resetval="0x0" description="Claim Tag Set Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_ITCTRL" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_ITCTRL" offset="0x32F00" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Claim Tag Clear Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_CLAIMSET" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_CLAIMSET" offset="0x32FA0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_LOCKACCESS" width="32" begin="31" end="0" resetval="0x0" description="Lock Access Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_CLAIMCLR" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_CLAIMCLR" offset="0x32FA4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_LOCKSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Lock Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_LOCKACCESS" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_LOCKACCESS" offset="0x32FB0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Authentication Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_LOCKSTATUS" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_LOCKSTATUS" offset="0x32FB4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Device Identifier" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_AUTHSTATUS" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_AUTHSTATUS" offset="0x32FB8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_MR_DEVTYPE" width="32" begin="31" end="0" resetval="0x0" description="Device Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_DEVID" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_DEVID" offset="0x32FC8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_MR_DEVTYPE" acronym="DEBUGSS_MSS_R5SS0_B_APB_MR_DEVTYPE" offset="0x32FCC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID4" acronym="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID4" offset="0x32FD0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID0" acronym="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID0" offset="0x32FE0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID1" acronym="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID1" offset="0x32FE4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_PERIP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID2" acronym="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID2" offset="0x32FE8" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID3" acronym="DEBUGSS_MSS_R5SS0_B_APB_PERIP_ID3" offset="0x32FEC" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID0" acronym="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID0" offset="0x32FF0" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID1" acronym="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID1" offset="0x32FF4" width="32" description="">
		<bitfield id="MSS_R5SS0_APB_COMP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID2" acronym="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID2" offset="0x32FF8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_CONTROL" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDGDIHE.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDHBDIA.html" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID3" acronym="DEBUGSS_MSS_R5SS0_B_APB_COMP_ID3" offset="0x32FFC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_CONTROL" acronym="DEBUGSS_MSS_R5SS0_A_CTI_CONTROL" offset="0x38000" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_APPSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
