IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INTACK" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INTACK" offset="0x38010" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_APPCLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_APPSET" acronym="DEBUGSS_MSS_R5SS0_A_CTI_APPSET" offset="0x38014" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_APPPULSE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_APPCLEAR" acronym="DEBUGSS_MSS_R5SS0_A_CTI_APPCLEAR" offset="0x38018" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_APPPULSE" acronym="DEBUGSS_MSS_R5SS0_A_CTI_APPPULSE" offset="0x3801C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN0" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN0" offset="0x38020" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN1" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN1" offset="0x38024" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN2" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN2" offset="0x38028" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN3" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN3" offset="0x3802C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN4" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN4" offset="0x38030" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN5" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN5" offset="0x38034" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN6" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN6" offset="0x38038" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_INEN7" acronym="DEBUGSS_MSS_R5SS0_A_CTI_INEN7" offset="0x3803C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN0" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN0" offset="0x380A0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN1" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN1" offset="0x380A4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN2" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN2" offset="0x380A8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN3" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN3" offset="0x380AC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN4" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN4" offset="0x380B0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN5" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN5" offset="0x380B4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN6" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN6" offset="0x380B8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_TRIGINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN7" acronym="DEBUGSS_MSS_R5SS0_A_CTI_OUTEN7" offset="0x380BC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_TRIGOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_TRIGINSTATUS" acronym="DEBUGSS_MSS_R5SS0_A_CTI_TRIGINSTATUS" offset="0x38130" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_CHINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_TRIGOUTSTATUS" acronym="DEBUGSS_MSS_R5SS0_A_CTI_TRIGOUTSTATUS" offset="0x38134" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_CHOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_CHINSTATUS" acronym="DEBUGSS_MSS_R5SS0_A_CTI_CHINSTATUS" offset="0x38138" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_GATE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_CHOUTSTATUS" acronym="DEBUGSS_MSS_R5SS0_A_CTI_CHOUTSTATUS" offset="0x3813C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ASICCTL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_GATE" acronym="DEBUGSS_MSS_R5SS0_A_CTI_GATE" offset="0x38140" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_ASICCTL" acronym="DEBUGSS_MSS_R5SS0_A_CTI_ASICCTL" offset="0x38144" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_ITCHINACK" acronym="DEBUGSS_MSS_R5SS0_A_CTI_ITCHINACK" offset="0x38EDC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_ITTRIGINACK" acronym="DEBUGSS_MSS_R5SS0_A_CTI_ITTRIGINACK" offset="0x38EE0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_ITCHOUT" acronym="DEBUGSS_MSS_R5SS0_A_CTI_ITCHOUT" offset="0x38EE4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_ITTRIGOUT" acronym="DEBUGSS_MSS_R5SS0_A_CTI_ITTRIGOUT" offset="0x38EE8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_ITCHOUTACK" acronym="DEBUGSS_MSS_R5SS0_A_CTI_ITCHOUTACK" offset="0x38EEC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_ITTRIGOUTACK" acronym="DEBUGSS_MSS_R5SS0_A_CTI_ITTRIGOUTACK" offset="0x38EF0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
