IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_CTI_COMPONENT_ID3" acronym="DEBUGSS_MSS_R5SS0_A_CTI_COMPONENT_ID3" offset="0x38FFC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_CONTROL" acronym="DEBUGSS_MSS_R5SS0_B_CTI_CONTROL" offset="0x39000" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_APPSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INTACK" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INTACK" offset="0x39010" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_APPCLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_APPSET" acronym="DEBUGSS_MSS_R5SS0_B_CTI_APPSET" offset="0x39014" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_APPPULSE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_APPCLEAR" acronym="DEBUGSS_MSS_R5SS0_B_CTI_APPCLEAR" offset="0x39018" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_APPPULSE" acronym="DEBUGSS_MSS_R5SS0_B_CTI_APPPULSE" offset="0x3901C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN0" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN0" offset="0x39020" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN1" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN1" offset="0x39024" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN2" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN2" offset="0x39028" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN3" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN3" offset="0x3902C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN4" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN4" offset="0x39030" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN5" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN5" offset="0x39034" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_INEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN6" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN6" offset="0x39038" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_INEN7" acronym="DEBUGSS_MSS_R5SS0_B_CTI_INEN7" offset="0x3903C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN0" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN0" offset="0x390A0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN1" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN1" offset="0x390A4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN2" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN2" offset="0x390A8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN3" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN3" offset="0x390AC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN4" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN4" offset="0x390B0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN5" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN5" offset="0x390B4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_OUTEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN6" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN6" offset="0x390B8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_TRIGINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN7" acronym="DEBUGSS_MSS_R5SS0_B_CTI_OUTEN7" offset="0x390BC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_TRIGOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_TRIGINSTATUS" acronym="DEBUGSS_MSS_R5SS0_B_CTI_TRIGINSTATUS" offset="0x39130" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_CHINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_TRIGOUTSTATUS" acronym="DEBUGSS_MSS_R5SS0_B_CTI_TRIGOUTSTATUS" offset="0x39134" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_CHOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_CHINSTATUS" acronym="DEBUGSS_MSS_R5SS0_B_CTI_CHINSTATUS" offset="0x39138" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_GATE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_CHOUTSTATUS" acronym="DEBUGSS_MSS_R5SS0_B_CTI_CHOUTSTATUS" offset="0x3913C" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ASICCTL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_GATE" acronym="DEBUGSS_MSS_R5SS0_B_CTI_GATE" offset="0x39140" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ASICCTL" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ASICCTL" offset="0x39144" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITCHINACK" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITCHINACK" offset="0x39EDC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGINACK" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGINACK" offset="0x39EE0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITCHOUT" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITCHOUT" offset="0x39EE4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
