IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGOUT" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGOUT" offset="0x39EE8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGOUTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITCHOUTACK" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITCHOUTACK" offset="0x39EEC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCHIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGOUTACK" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGOUTACK" offset="0x39EF0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITTRIGIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITCHIN" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITCHIN" offset="0x39EF4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGIN" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITTRIGIN" offset="0x39EF8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_CLAIM_TAG_SET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_ITCTRL" acronym="DEBUGSS_MSS_R5SS0_B_CTI_ITCTRL" offset="0x39F00" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_CLAIM_TAG_CLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_CLAIM_TAG_SET" acronym="DEBUGSS_MSS_R5SS0_B_CTI_CLAIM_TAG_SET" offset="0x39FA0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_LOCK_ACCESS_REGISTER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_CLAIM_TAG_CLEAR" acronym="DEBUGSS_MSS_R5SS0_B_CTI_CLAIM_TAG_CLEAR" offset="0x39FA4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_LOCK_STATUS_REGISTER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_LOCK_ACCESS_REGISTER" acronym="DEBUGSS_MSS_R5SS0_B_CTI_LOCK_ACCESS_REGISTER" offset="0x39FB0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_AUTHENTICATION_STATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_LOCK_STATUS_REGISTER" acronym="DEBUGSS_MSS_R5SS0_B_CTI_LOCK_STATUS_REGISTER" offset="0x39FB4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_DEVICE_ID" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_AUTHENTICATION_STATUS" acronym="DEBUGSS_MSS_R5SS0_B_CTI_AUTHENTICATION_STATUS" offset="0x39FB8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_DEVICE_TYPE_IDENTIFIER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_DEVICE_ID" acronym="DEBUGSS_MSS_R5SS0_B_CTI_DEVICE_ID" offset="0x39FC8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_DEVICE_TYPE_IDENTIFIER" acronym="DEBUGSS_MSS_R5SS0_B_CTI_DEVICE_TYPE_IDENTIFIER" offset="0x39FCC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID4" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID4" offset="0x39FD0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID5" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID5" offset="0x39FD4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID6" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID6" offset="0x39FD8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID7" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID7" offset="0x39FDC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID0" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID0" offset="0x39FE0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID1" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID1" offset="0x39FE4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_PERIPHERALID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID2" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID2" offset="0x39FE8" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_COMPONENT_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID3" acronym="DEBUGSS_MSS_R5SS0_B_CTI_PERIPHERALID3" offset="0x39FEC" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_COMPONENT_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID0" acronym="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID0" offset="0x39FF0" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_COMPONENT_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID1" acronym="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID1" offset="0x39FF4" width="32" description="">
		<bitfield id="MSS_R5SS0_CTI_COMPONENT_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID2" acronym="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID2" offset="0x39FF8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CR" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.ihi0014q/Chdfiagc.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ihi0014q/I84249.html" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID3" acronym="DEBUGSS_MSS_R5SS0_B_CTI_COMPONENT_ID3" offset="0x39FFC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CR" offset="0x3C000" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TRIGGER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CCR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CCR" offset="0x3C004" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ASICCTLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_TRIGGER" acronym="DEBUGSS_MSS_R5SS0_A_ETM_TRIGGER" offset="0x3C008" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ASICCTLR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ASICCTLR" offset="0x3C00C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_SR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_SR" offset="0x3C010" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TSSCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
