IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_SCR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_SCR" offset="0x3C014" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TECR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_TSSCR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_TSSCR" offset="0x3C018" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TEEVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_TECR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_TECR2" offset="0x3C01C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TECR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_TEEVR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_TEEVR" offset="0x3C020" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_FFRR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_TECR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_TECR1" offset="0x3C024" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_FFLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_FFRR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_FFRR" offset="0x3C028" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDEVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_FFLR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_FFLR" offset="0x3C02C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDCR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_VDEVR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_VDEVR" offset="0x3C030" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDCR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_VDCR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_VDCR1" offset="0x3C034" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDCR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_VDCR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_VDCR2" offset="0x3C038" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_VDCR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_VDCR3" offset="0x3C03C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR1" offset="0x3C040" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR2" offset="0x3C044" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR3" offset="0x3C048" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR4" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR4" offset="0x3C04C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR5" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR5" offset="0x3C050" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR6" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR6" offset="0x3C054" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR7" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR7" offset="0x3C058" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR9" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR8" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR8" offset="0x3C05C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR10" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR9" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR9" offset="0x3C060" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR11" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR10" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR10" offset="0x3C064" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR12" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR11" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR11" offset="0x3C068" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR13" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR12" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR12" offset="0x3C06C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR14" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR13" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR13" offset="0x3C070" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR15" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR14" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR14" offset="0x3C074" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR16" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR15" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR15" offset="0x3C078" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_ACVR16" acronym="DEBUGSS_MSS_R5SS0_A_ETM_ACVR16" offset="0x3C07C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
