IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCVR8" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCVR8" offset="0x3C0F8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR1" offset="0x3C100" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR2" offset="0x3C108" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR3" offset="0x3C110" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR4" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR4" offset="0x3C118" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR5" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR5" offset="0x3C120" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR6" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR6" offset="0x3C128" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR7" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR7" offset="0x3C130" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DCMR8" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DCMR8" offset="0x3C138" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR1" offset="0x3C140" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR2" offset="0x3C144" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR3" offset="0x3C148" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR4" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDVR4" offset="0x3C14C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR1" offset="0x3C150" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR2" offset="0x3C154" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR3" offset="0x3C158" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR4" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTENR4" offset="0x3C15C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR1" offset="0x3C160" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR2" offset="0x3C164" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR3" offset="0x3C168" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR4" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTRLDEVR4" offset="0x3C16C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR1" offset="0x3C170" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR2" offset="0x3C174" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR3" offset="0x3C178" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ12EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR4" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CNTVR4" offset="0x3C17C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ21EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_SQ12EVR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_SQ12EVR" offset="0x3C180" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ23EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_SQ21EVR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_SQ21EVR" offset="0x3C184" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ31EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_SQ23EVR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_SQ23EVR" offset="0x3C188" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ32EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_SQ31EVR" acronym="DEBUGSS_MSS_R5SS0_A_ETM_SQ31EVR" offset="0x3C18C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ13EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
