IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DEVID" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DEVID" offset="0x3CFC8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_DEVTYPE" acronym="DEBUGSS_MSS_R5SS0_A_ETM_DEVTYPE" offset="0x3CFCC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR4" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR4" offset="0x3CFD0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR5" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR5" offset="0x3CFD4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR6" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR6" offset="0x3CFD8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR7" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR7" offset="0x3CFDC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR0" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR0" offset="0x3CFE0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR1" offset="0x3CFE4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR2" offset="0x3CFE8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_PIDR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_PIDR3" offset="0x3CFEC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CIDR0" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CIDR0" offset="0x3CFF0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CIDR1" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CIDR1" offset="0x3CFF4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CIDR2" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CIDR2" offset="0x3CFF8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CR" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/index.jsp?topic=/com.arm.doc.ihi0014q/Chdfiagc.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ihi0014q/I84249.html" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_A_ETM_CIDR3" acronym="DEBUGSS_MSS_R5SS0_A_ETM_CIDR3" offset="0x3CFFC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CR" offset="0x3D000" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TRIGGER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CCR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CCR" offset="0x3D004" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ASICCTLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_TRIGGER" acronym="DEBUGSS_MSS_R5SS0_B_ETM_TRIGGER" offset="0x3D008" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ASICCTLR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ASICCTLR" offset="0x3D00C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SR" offset="0x3D010" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TSSCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SCR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SCR" offset="0x3D014" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TECR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_TSSCR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_TSSCR" offset="0x3D018" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TEEVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_TECR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_TECR2" offset="0x3D01C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TECR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_TEEVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_TEEVR" offset="0x3D020" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_FFRR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_TECR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_TECR1" offset="0x3D024" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_FFLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_FFRR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_FFRR" offset="0x3D028" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDEVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_FFLR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_FFLR" offset="0x3D02C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDCR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
