IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_VDEVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_VDEVR" offset="0x3D030" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDCR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_VDCR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_VDCR1" offset="0x3D034" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_VDCR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_VDCR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_VDCR2" offset="0x3D038" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_VDCR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_VDCR3" offset="0x3D03C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR1" offset="0x3D040" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR2" offset="0x3D044" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR3" offset="0x3D048" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR4" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR4" offset="0x3D04C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR5" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR5" offset="0x3D050" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR6" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR6" offset="0x3D054" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR7" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR7" offset="0x3D058" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR9" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR8" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR8" offset="0x3D05C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR10" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR9" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR9" offset="0x3D060" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR11" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR10" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR10" offset="0x3D064" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR12" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR11" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR11" offset="0x3D068" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR13" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR12" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR12" offset="0x3D06C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR14" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR13" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR13" offset="0x3D070" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR15" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR14" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR14" offset="0x3D074" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACVR16" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR15" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR15" offset="0x3D078" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACVR16" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACVR16" offset="0x3D07C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ACTR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ACTR1" offset="0x3D080" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ACTR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
