IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_DCMR5" acronym="DEBUGSS_MSS_R5SS0_B_ETM_DCMR5" offset="0x3D120" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_DCMR6" acronym="DEBUGSS_MSS_R5SS0_B_ETM_DCMR6" offset="0x3D128" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DCMR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_DCMR7" acronym="DEBUGSS_MSS_R5SS0_B_ETM_DCMR7" offset="0x3D130" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_DCMR8" acronym="DEBUGSS_MSS_R5SS0_B_ETM_DCMR8" offset="0x3D138" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR1" offset="0x3D140" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR2" offset="0x3D144" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR3" offset="0x3D148" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR4" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDVR4" offset="0x3D14C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR1" offset="0x3D150" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR2" offset="0x3D154" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTENR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR3" offset="0x3D158" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR4" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTENR4" offset="0x3D15C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR1" offset="0x3D160" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR2" offset="0x3D164" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTRLDEVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR3" offset="0x3D168" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR4" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTRLDEVR4" offset="0x3D16C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR1" offset="0x3D170" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR2" offset="0x3D174" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CNTVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR3" offset="0x3D178" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ12EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR4" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CNTVR4" offset="0x3D17C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ21EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SQ12EVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SQ12EVR" offset="0x3D180" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ23EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SQ21EVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SQ21EVR" offset="0x3D184" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ31EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
