IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SQ23EVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SQ23EVR" offset="0x3D188" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ32EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SQ31EVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SQ31EVR" offset="0x3D18C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQ13EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SQ32EVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SQ32EVR" offset="0x3D190" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SQR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SQ13EVR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SQ13EVR" offset="0x3D194" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_EXTOUTEVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SQR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SQR" offset="0x3D19C" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_EXTOUTEVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR1" offset="0x3D1A0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_EXTOUTEVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR2" offset="0x3D1A4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_EXTOUTEVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR3" offset="0x3D1A8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDCVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR4" acronym="DEBUGSS_MSS_R5SS0_B_ETM_EXTOUTEVR4" offset="0x3D1AC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDCVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDCVR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDCVR1" offset="0x3D1B0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDCVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDCVR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDCVR2" offset="0x3D1B4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDCMR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDCVR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDCVR3" offset="0x3D1B8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_SYNCFR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDCMR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDCMR" offset="0x3D1BC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_IDR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_SYNCFR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_SYNCFR" offset="0x3D1E0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CCER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_IDR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_IDR" offset="0x3D1E4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_EXTINSELR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CCER" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CCER" offset="0x3D1E8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_TRACEIDR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_EXTINSELR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_EXTINSELR" offset="0x3D1EC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PDSR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_TRACEIDR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_TRACEIDR" offset="0x3D200" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITETMIF" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PDSR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PDSR" offset="0x3D314" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITMISCOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITETMIF" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITETMIF" offset="0x3DED8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITMISCIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITMISCOUT" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITMISCOUT" offset="0x3DEDC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITTRIGGERACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITMISCIN" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITMISCIN" offset="0x3DEE0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITTRIGGERREQ" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITTRIGGERACK" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITTRIGGERACK" offset="0x3DEE4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITATBDATA0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITTRIGGERREQ" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITTRIGGERREQ" offset="0x3DEE8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITATBCTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITATBDATA0" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITATBDATA0" offset="0x3DEEC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITATBCTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITATBCTR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITATBCTR2" offset="0x3DEF0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITATBCTR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITATBCTR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITATBCTR1" offset="0x3DEF4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
