IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITATBCTR0" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITATBCTR0" offset="0x3DEF8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CLAIMSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_ITCTRL" acronym="DEBUGSS_MSS_R5SS0_B_ETM_ITCTRL" offset="0x3DF00" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CLAIMSET" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CLAIMSET" offset="0x3DFA0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_LAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CLAIMCLR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CLAIMCLR" offset="0x3DFA4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_LSR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_LAR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_LAR" offset="0x3DFB0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_LSR" acronym="DEBUGSS_MSS_R5SS0_B_ETM_LSR" offset="0x3DFB4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_AUTHSTATUS" acronym="DEBUGSS_MSS_R5SS0_B_ETM_AUTHSTATUS" offset="0x3DFB8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_DEVTYPE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_DEVID" acronym="DEBUGSS_MSS_R5SS0_B_ETM_DEVID" offset="0x3DFC8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_DEVTYPE" acronym="DEBUGSS_MSS_R5SS0_B_ETM_DEVTYPE" offset="0x3DFCC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR4" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR4" offset="0x3DFD0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR5" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR5" offset="0x3DFD4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR6" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR6" offset="0x3DFD8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR7" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR7" offset="0x3DFDC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR0" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR0" offset="0x3DFE0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR1" offset="0x3DFE4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_PIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR2" offset="0x3DFE8" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_PIDR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_PIDR3" offset="0x3DFEC" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDR0" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDR0" offset="0x3DFF0" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDR1" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDR1" offset="0x3DFF4" width="32" description="">
		<bitfield id="MSS_R5SS0_ETM_CIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDR2" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDR2" offset="0x3DFF8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDIDR" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0363e/Cegejeeb.htmlDebug Identification Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS0_B_ETM_CIDR3" acronym="DEBUGSS_MSS_R5SS0_B_ETM_CIDR3" offset="0x3DFFC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWFAR" width="32" begin="31" end="0" resetval="0x0" description="Watchpoint Fault Address Register" range="31 - 0" rwaccess="RW"/>
	</register>
