IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_ROM" acronym="DEBUGSS_MSS_R5SS1_ROM" offset="0x40000" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGVCR" width="32" begin="31" end="0" resetval="0x0" description="Vector Catch Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGDIDR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGDIDR" offset="0x50000" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGECR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWFAR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWFAR" offset="0x50018" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDSCCR" width="32" begin="31" end="0" resetval="0x0" description="Debug State Cache Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGVCR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGVCR" offset="0x5001C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDTRRX" width="32" begin="31" end="0" resetval="0x0" description="Host to Target Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGECR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGECR" offset="0x50024" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGITR" width="32" begin="31" end="0" resetval="0x0" description="Instruction Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGDSCCR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGDSCCR" offset="0x50028" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDSCR" width="32" begin="31" end="0" resetval="0x0" description="Debug Status and Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGDTRRX" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGDTRRX" offset="0x50080" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDTRTX" width="32" begin="31" end="0" resetval="0x0" description="Target to Host Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGITR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGITR" offset="0x50084" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDRCR" width="32" begin="31" end="0" resetval="0x0" description="Debug Run Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGDSCR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGDSCR" offset="0x50088" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR0" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGDTRTX" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGDTRTX" offset="0x5008C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR1" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGDRCR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGDRCR" offset="0x50090" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR2" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR0" offset="0x50100" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR3" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR1" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR1" offset="0x50104" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR4" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR2" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR2" offset="0x50108" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR5" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR3" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR3" offset="0x5010C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR6" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR4" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR4" offset="0x50110" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBVR7" width="32" begin="31" end="0" resetval="0x0" description="Break Point Value Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR5" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR5" offset="0x50114" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR0" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR6" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR6" offset="0x50118" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR1" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR7" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBVR7" offset="0x5011C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR2" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR0" offset="0x50140" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR3" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
