IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR1" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR1" offset="0x50144" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR4" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR2" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR2" offset="0x50148" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR5" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR3" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR3" offset="0x5014C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR6" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR4" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR4" offset="0x50150" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGBCR7" width="32" begin="31" end="0" resetval="0x0" description="Break Point Control Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR5" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR5" offset="0x50154" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR0" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR6" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR6" offset="0x50158" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR1" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR7" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGBCR7" offset="0x5015C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR2" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR0" offset="0x50180" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR3" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR1" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR1" offset="0x50184" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR4" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR2" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR2" offset="0x50188" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR5" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR3" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR3" offset="0x5018C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR6" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR4" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR4" offset="0x50190" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWVR7" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Value Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR5" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR5" offset="0x50194" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR0" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR6" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR6" offset="0x50198" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR1" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR7" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWVR7" offset="0x5019C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR2" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR0" offset="0x501C0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR3" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR1" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR1" offset="0x501C4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR4" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR2" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR2" offset="0x501C8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR5" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR3" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR3" offset="0x501CC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR6" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 6" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR4" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR4" offset="0x501D0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWCR7" width="32" begin="31" end="0" resetval="0x0" description="Watch Point Control Register 7" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR5" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR5" offset="0x501D4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGOSLAR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
