IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR6" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR6" offset="0x501D8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGOSLSR" width="32" begin="31" end="0" resetval="0x0" description="Operating System Lock Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR7" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGWCR7" offset="0x501DC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGOSSRR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGOSLAR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGOSLAR" offset="0x50300" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGPRCR" width="32" begin="31" end="0" resetval="0x0" description="Device Power Down and Reset Control Regsiter" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGOSLSR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGOSLSR" offset="0x50304" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGPRSR" width="32" begin="31" end="0" resetval="0x0" description="Device Power Down and Reset Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGOSSRR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGOSSRR" offset="0x50308" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MIDR" width="32" begin="31" end="0" resetval="0x0" description="Main ID Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGPRCR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGPRCR" offset="0x50310" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_CTR" width="32" begin="31" end="0" resetval="0x0" description="Cache Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_DBGPRSR" acronym="DEBUGSS_MSS_R5SS1_A_APB_DBGPRSR" offset="0x50314" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_TCMTR" width="32" begin="31" end="0" resetval="0x0" description="TCM Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MIDR" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MIDR" offset="0x50D00" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MPUIR" width="32" begin="31" end="0" resetval="0x0" description="MPU Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_CTR" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_CTR" offset="0x50D04" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MPIDR" width="32" begin="31" end="0" resetval="0x0" description="Multiprocessor Affinity Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_TCMTR" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_TCMTR" offset="0x50D08" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_PFR0" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MPUIR" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MPUIR" offset="0x50D10" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_PFR1" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MPIDR" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MPIDR" offset="0x50D14" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_DFR0" width="32" begin="31" end="0" resetval="0x0" description="Debug Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_PFR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_PFR0" offset="0x50D20" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_AFR0" width="32" begin="31" end="0" resetval="0x0" description="Auxiliary Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_PFR1" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_PFR1" offset="0x50D24" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR0" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_DFR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_DFR0" offset="0x50D28" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR1" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_AFR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_AFR0" offset="0x50D2C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR2" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR0" offset="0x50D30" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR3" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR1" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR1" offset="0x50D34" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR0" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR2" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR2" offset="0x50D38" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR1" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR3" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_MMFR3" offset="0x50D3C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR2" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
