IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR0" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR0" offset="0x50D40" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR3" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR1" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR1" offset="0x50D44" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR4" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR2" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR2" offset="0x50D48" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR5" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR3" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR3" offset="0x50D4C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Integration Mode Control Registers" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR4" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR4" offset="0x50D50" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_CLAIMSET" width="32" begin="31" end="0" resetval="0x0" description="Claim Tag Set Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR5" acronym="DEBUGSS_MSS_R5SS1_A_APB_PROCID_ISAR5" offset="0x50D54" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Claim Tag Clear Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_ITCTRL" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_ITCTRL" offset="0x50F00" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_LOCKACCESS" width="32" begin="31" end="0" resetval="0x0" description="Lock Access Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_CLAIMSET" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_CLAIMSET" offset="0x50FA0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_LOCKSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Lock Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_CLAIMCLR" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_CLAIMCLR" offset="0x50FA4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Authentication Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_LOCKACCESS" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_LOCKACCESS" offset="0x50FB0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Device Identifier" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_LOCKSTATUS" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_LOCKSTATUS" offset="0x50FB4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_DEVTYPE" width="32" begin="31" end="0" resetval="0x0" description="Device Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_AUTHSTATUS" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_AUTHSTATUS" offset="0x50FB8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_DEVID" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_DEVID" offset="0x50FC8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_MR_DEVTYPE" acronym="DEBUGSS_MSS_R5SS1_A_APB_MR_DEVTYPE" offset="0x50FCC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID4" acronym="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID4" offset="0x50FD0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID0" acronym="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID0" offset="0x50FE0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID1" acronym="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID1" offset="0x50FE4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID2" acronym="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID2" offset="0x50FE8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID3" acronym="DEBUGSS_MSS_R5SS1_A_APB_PERIP_ID3" offset="0x50FEC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID0" acronym="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID0" offset="0x50FF0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID1" acronym="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID1" offset="0x50FF4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDIDR" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0363e/Cegejeeb.htmlDebug Identification Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID2" acronym="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID2" offset="0x50FF8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGWFAR" width="32" begin="31" end="0" resetval="0x0" description="Watchpoint Fault Address Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID3" acronym="DEBUGSS_MSS_R5SS1_A_APB_COMP_ID3" offset="0x50FFC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGVCR" width="32" begin="31" end="0" resetval="0x0" description="Vector Catch Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_DBGDIDR" acronym="DEBUGSS_MSS_R5SS1_B_APB_DBGDIDR" offset="0x52000" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGECR" width="32" begin="31" end="0" resetval="0x0" description="Not Implemented" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_DBGWFAR" acronym="DEBUGSS_MSS_R5SS1_B_APB_DBGWFAR" offset="0x52018" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDSCCR" width="32" begin="31" end="0" resetval="0x0" description="Debug State Cache Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_DBGVCR" acronym="DEBUGSS_MSS_R5SS1_B_APB_DBGVCR" offset="0x5201C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDTRRX" width="32" begin="31" end="0" resetval="0x0" description="Host to Target Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_DBGECR" acronym="DEBUGSS_MSS_R5SS1_B_APB_DBGECR" offset="0x52024" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGITR" width="32" begin="31" end="0" resetval="0x0" description="Instruction Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_DBGDSCCR" acronym="DEBUGSS_MSS_R5SS1_B_APB_DBGDSCCR" offset="0x52028" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDSCR" width="32" begin="31" end="0" resetval="0x0" description="Debug Status and Control Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_DBGDTRRX" acronym="DEBUGSS_MSS_R5SS1_B_APB_DBGDTRRX" offset="0x52080" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_DBGDTRTX" width="32" begin="31" end="0" resetval="0x0" description="Target to Host Data Transfer Register" range="31 - 0" rwaccess="RW"/>
	</register>
