IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_TCMTR" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_TCMTR" offset="0x52D08" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_PFR0" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MPUIR" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MPUIR" offset="0x52D10" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_PFR1" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MPIDR" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MPIDR" offset="0x52D14" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_DFR0" width="32" begin="31" end="0" resetval="0x0" description="Debug Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_PFR0" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_PFR0" offset="0x52D20" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_AFR0" width="32" begin="31" end="0" resetval="0x0" description="Auxiliary Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_PFR1" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_PFR1" offset="0x52D24" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR0" width="32" begin="31" end="0" resetval="0x0" description="Processor Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_DFR0" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_DFR0" offset="0x52D28" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR1" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_AFR0" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_AFR0" offset="0x52D2C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR2" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR0" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR0" offset="0x52D30" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_MMFR3" width="32" begin="31" end="0" resetval="0x0" description="Memory Model Feature Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR1" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR1" offset="0x52D34" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR0" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 0" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR2" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR2" offset="0x52D38" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR1" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 1" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR3" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_MMFR3" offset="0x52D3C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR2" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 2" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR0" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR0" offset="0x52D40" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR3" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 3" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR1" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR1" offset="0x52D44" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR4" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 4" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR2" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR2" offset="0x52D48" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PROCID_ISAR5" width="32" begin="31" end="0" resetval="0x0" description="ISA Feature Register 5" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR3" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR3" offset="0x52D4C" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Integration Mode Control Registers" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR4" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR4" offset="0x52D50" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_CLAIMSET" width="32" begin="31" end="0" resetval="0x0" description="Claim Tag Set Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR5" acronym="DEBUGSS_MSS_R5SS1_B_APB_PROCID_ISAR5" offset="0x52D54" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Claim Tag Clear Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_ITCTRL" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_ITCTRL" offset="0x52F00" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_LOCKACCESS" width="32" begin="31" end="0" resetval="0x0" description="Lock Access Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_CLAIMSET" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_CLAIMSET" offset="0x52FA0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_LOCKSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Lock Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
