IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_CLAIMCLR" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_CLAIMCLR" offset="0x52FA4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Authentication Status Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_LOCKACCESS" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_LOCKACCESS" offset="0x52FB0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Device Identifier" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_LOCKSTATUS" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_LOCKSTATUS" offset="0x52FB4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_MR_DEVTYPE" width="32" begin="31" end="0" resetval="0x0" description="Device Type Register" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_AUTHSTATUS" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_AUTHSTATUS" offset="0x52FB8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_DEVID" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_DEVID" offset="0x52FC8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_MR_DEVTYPE" acronym="DEBUGSS_MSS_R5SS1_B_APB_MR_DEVTYPE" offset="0x52FCC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID4" acronym="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID4" offset="0x52FD0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID0" acronym="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID0" offset="0x52FE0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_PERIP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID1" acronym="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID1" offset="0x52FE4" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID2" acronym="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID2" offset="0x52FE8" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID3" acronym="DEBUGSS_MSS_R5SS1_B_APB_PERIP_ID3" offset="0x52FEC" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID0" acronym="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID0" offset="0x52FF0" width="32" description="">
		<bitfield id="MSS_R5SS1_APB_COMP_ID3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID1" acronym="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID1" offset="0x52FF4" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_CONTROL" width="32" begin="31" end="0" resetval="0x0" description="http://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDGDIHE.htmlhttp://infocenter.arm.com/help/topic/com.arm.doc.ddi0480e/CHDHBDIA.html" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID2" acronym="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID2" offset="0x52FF8" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INTACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID3" acronym="DEBUGSS_MSS_R5SS1_B_APB_COMP_ID3" offset="0x52FFC" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_APPSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_CTI_CONTROL" acronym="DEBUGSS_MSS_R5SS1_A_CTI_CONTROL" offset="0x58000" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_APPCLEAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_CTI_INTACK" acronym="DEBUGSS_MSS_R5SS1_A_CTI_INTACK" offset="0x58010" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_APPPULSE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_CTI_APPSET" acronym="DEBUGSS_MSS_R5SS1_A_CTI_APPSET" offset="0x58014" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_CTI_APPCLEAR" acronym="DEBUGSS_MSS_R5SS1_A_CTI_APPCLEAR" offset="0x58018" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_CTI_APPPULSE" acronym="DEBUGSS_MSS_R5SS1_A_CTI_APPPULSE" offset="0x5801C" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_CTI_INEN0" acronym="DEBUGSS_MSS_R5SS1_A_CTI_INEN0" offset="0x58020" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_CTI_INEN1" acronym="DEBUGSS_MSS_R5SS1_A_CTI_INEN1" offset="0x58024" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
