IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_APPSET" acronym="DEBUGSS_MSS_R5SS1_B_CTI_APPSET" offset="0x59014" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_APPCLEAR" acronym="DEBUGSS_MSS_R5SS1_B_CTI_APPCLEAR" offset="0x59018" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_APPPULSE" acronym="DEBUGSS_MSS_R5SS1_B_CTI_APPPULSE" offset="0x5901C" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN0" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN0" offset="0x59020" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN1" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN1" offset="0x59024" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN2" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN2" offset="0x59028" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN3" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN3" offset="0x5902C" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN4" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN4" offset="0x59030" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_INEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN5" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN5" offset="0x59034" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN6" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN6" offset="0x59038" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_INEN7" acronym="DEBUGSS_MSS_R5SS1_B_CTI_INEN7" offset="0x5903C" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN0" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN0" offset="0x590A0" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN1" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN1" offset="0x590A4" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN2" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN2" offset="0x590A8" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN3" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN3" offset="0x590AC" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN4" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN4" offset="0x590B0" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_OUTEN7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN5" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN5" offset="0x590B4" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_TRIGINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN6" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN6" offset="0x590B8" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_TRIGOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN7" acronym="DEBUGSS_MSS_R5SS1_B_CTI_OUTEN7" offset="0x590BC" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_CHINSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_TRIGINSTATUS" acronym="DEBUGSS_MSS_R5SS1_B_CTI_TRIGINSTATUS" offset="0x59130" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_CHOUTSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_TRIGOUTSTATUS" acronym="DEBUGSS_MSS_R5SS1_B_CTI_TRIGOUTSTATUS" offset="0x59134" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_GATE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_CHINSTATUS" acronym="DEBUGSS_MSS_R5SS1_B_CTI_CHINSTATUS" offset="0x59138" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_ASICCTL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_CHOUTSTATUS" acronym="DEBUGSS_MSS_R5SS1_B_CTI_CHOUTSTATUS" offset="0x5913C" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_ITCHINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_GATE" acronym="DEBUGSS_MSS_R5SS1_B_CTI_GATE" offset="0x59140" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_ITTRIGINACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_ASICCTL" acronym="DEBUGSS_MSS_R5SS1_B_CTI_ASICCTL" offset="0x59144" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_ITCHOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_ITCHINACK" acronym="DEBUGSS_MSS_R5SS1_B_CTI_ITCHINACK" offset="0x59EDC" width="32" description="">
		<bitfield id="MSS_R5SS1_CTI_ITTRIGOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
