IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_CTI_COMPONENT_ID3" acronym="DEBUGSS_MSS_R5SS1_B_CTI_COMPONENT_ID3" offset="0x59FFC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TRIGGER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CR" offset="0x5C000" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ASICCTLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CCR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CCR" offset="0x5C004" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_TRIGGER" acronym="DEBUGSS_MSS_R5SS1_A_ETM_TRIGGER" offset="0x5C008" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ASICCTLR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ASICCTLR" offset="0x5C00C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TSSCR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SR" offset="0x5C010" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TECR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SCR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SCR" offset="0x5C014" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TEEVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_TSSCR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_TSSCR" offset="0x5C018" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TECR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_TECR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_TECR2" offset="0x5C01C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_FFRR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_TEEVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_TEEVR" offset="0x5C020" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_FFLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_TECR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_TECR1" offset="0x5C024" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDEVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_FFRR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_FFRR" offset="0x5C028" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDCR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_FFLR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_FFLR" offset="0x5C02C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDCR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_VDEVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_VDEVR" offset="0x5C030" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDCR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_VDCR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_VDCR1" offset="0x5C034" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_VDCR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_VDCR2" offset="0x5C038" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_VDCR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_VDCR3" offset="0x5C03C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR1" offset="0x5C040" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR2" offset="0x5C044" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR3" offset="0x5C048" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR4" offset="0x5C04C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR5" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR5" offset="0x5C050" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
