IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR6" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR6" offset="0x5C054" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR9" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR7" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR7" offset="0x5C058" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR10" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR8" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR8" offset="0x5C05C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR11" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR9" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR9" offset="0x5C060" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR12" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR10" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR10" offset="0x5C064" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR13" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR11" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR11" offset="0x5C068" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR14" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR12" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR12" offset="0x5C06C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR15" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR13" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR13" offset="0x5C070" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR16" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR14" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR14" offset="0x5C074" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR15" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR15" offset="0x5C078" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACVR16" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACVR16" offset="0x5C07C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR1" offset="0x5C080" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR2" offset="0x5C084" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR3" offset="0x5C088" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR4" offset="0x5C08C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR5" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR5" offset="0x5C090" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR6" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR6" offset="0x5C094" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR9" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR7" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR7" offset="0x5C098" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR10" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR8" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR8" offset="0x5C09C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR11" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR9" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR9" offset="0x5C0A0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR12" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR10" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR10" offset="0x5C0A4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR13" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR11" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR11" offset="0x5C0A8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR14" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR12" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR12" offset="0x5C0AC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR15" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
