IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR13" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR13" offset="0x5C0B0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR16" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR14" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR14" offset="0x5C0B4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR15" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR15" offset="0x5C0B8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ACTR16" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ACTR16" offset="0x5C0BC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR1" offset="0x5C0C0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR2" offset="0x5C0C8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR3" offset="0x5C0D0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR4" offset="0x5C0D8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR5" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR5" offset="0x5C0E0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR6" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR6" offset="0x5C0E8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR7" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR7" offset="0x5C0F0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCVR8" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCVR8" offset="0x5C0F8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR1" offset="0x5C100" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR2" offset="0x5C108" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR3" offset="0x5C110" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR4" offset="0x5C118" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR5" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR5" offset="0x5C120" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR6" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR6" offset="0x5C128" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR7" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR7" offset="0x5C130" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_DCMR8" acronym="DEBUGSS_MSS_R5SS1_A_ETM_DCMR8" offset="0x5C138" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR1" offset="0x5C140" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
