IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR2" offset="0x5C144" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR3" offset="0x5C148" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDVR4" offset="0x5C14C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR1" offset="0x5C150" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR2" offset="0x5C154" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR3" offset="0x5C158" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTENR4" offset="0x5C15C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR1" offset="0x5C160" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR2" offset="0x5C164" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR3" offset="0x5C168" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTRLDEVR4" offset="0x5C16C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR1" offset="0x5C170" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR2" offset="0x5C174" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ12EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR3" offset="0x5C178" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ21EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CNTVR4" offset="0x5C17C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ23EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SQ12EVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SQ12EVR" offset="0x5C180" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ31EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SQ21EVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SQ21EVR" offset="0x5C184" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ32EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SQ23EVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SQ23EVR" offset="0x5C188" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ13EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SQ31EVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SQ31EVR" offset="0x5C18C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SQ32EVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SQ32EVR" offset="0x5C190" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SQ13EVR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SQ13EVR" offset="0x5C194" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SQR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SQR" offset="0x5C19C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR1" offset="0x5C1A0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
