IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR2" offset="0x5C1A4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR3" offset="0x5C1A8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR4" acronym="DEBUGSS_MSS_R5SS1_A_ETM_EXTOUTEVR4" offset="0x5C1AC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CIDCVR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CIDCVR1" offset="0x5C1B0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCMR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CIDCVR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CIDCVR2" offset="0x5C1B4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SYNCFR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CIDCVR3" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CIDCVR3" offset="0x5C1B8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_IDR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CIDCMR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CIDCMR" offset="0x5C1BC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CCER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_SYNCFR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_SYNCFR" offset="0x5C1E0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTINSELR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_IDR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_IDR" offset="0x5C1E4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TRACEIDR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CCER" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CCER" offset="0x5C1E8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PDSR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_EXTINSELR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_EXTINSELR" offset="0x5C1EC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITETMIF" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_TRACEIDR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_TRACEIDR" offset="0x5C200" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITMISCOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_PDSR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_PDSR" offset="0x5C314" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITMISCIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITETMIF" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITETMIF" offset="0x5CED8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITTRIGGERACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITMISCOUT" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITMISCOUT" offset="0x5CEDC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITTRIGGERREQ" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITMISCIN" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITMISCIN" offset="0x5CEE0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBDATA0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITTRIGGERACK" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITTRIGGERACK" offset="0x5CEE4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBCTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITTRIGGERREQ" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITTRIGGERREQ" offset="0x5CEE8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBCTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITATBDATA0" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITATBDATA0" offset="0x5CEEC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBCTR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITATBCTR2" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITATBCTR2" offset="0x5CEF0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITATBCTR1" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITATBCTR1" offset="0x5CEF4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CLAIMSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITATBCTR0" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITATBCTR0" offset="0x5CEF8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_ITCTRL" acronym="DEBUGSS_MSS_R5SS1_A_ETM_ITCTRL" offset="0x5CF00" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_LAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CLAIMSET" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CLAIMSET" offset="0x5CFA0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_LSR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_CLAIMCLR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_CLAIMCLR" offset="0x5CFA4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_LAR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_LAR" offset="0x5CFB0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_A_ETM_LSR" acronym="DEBUGSS_MSS_R5SS1_A_ETM_LSR" offset="0x5CFB4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DEVTYPE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
