IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_TSSCR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_TSSCR" offset="0x5D018" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TECR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_TECR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_TECR2" offset="0x5D01C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_FFRR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_TEEVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_TEEVR" offset="0x5D020" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_FFLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_TECR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_TECR1" offset="0x5D024" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDEVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_FFRR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_FFRR" offset="0x5D028" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDCR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_FFLR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_FFLR" offset="0x5D02C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDCR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_VDEVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_VDEVR" offset="0x5D030" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_VDCR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_VDCR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_VDCR1" offset="0x5D034" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_VDCR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_VDCR2" offset="0x5D038" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_VDCR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_VDCR3" offset="0x5D03C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR1" offset="0x5D040" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR2" offset="0x5D044" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR3" offset="0x5D048" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR4" offset="0x5D04C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR5" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR5" offset="0x5D050" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR6" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR6" offset="0x5D054" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR9" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR7" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR7" offset="0x5D058" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR10" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR8" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR8" offset="0x5D05C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR11" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR9" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR9" offset="0x5D060" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR12" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR10" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR10" offset="0x5D064" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR13" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR11" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR11" offset="0x5D068" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR14" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR12" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR12" offset="0x5D06C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR15" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR13" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR13" offset="0x5D070" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACVR16" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
