IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR14" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR14" offset="0x5D074" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR15" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR15" offset="0x5D078" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACVR16" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACVR16" offset="0x5D07C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR1" offset="0x5D080" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR2" offset="0x5D084" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR3" offset="0x5D088" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR4" offset="0x5D08C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR5" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR5" offset="0x5D090" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR6" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR6" offset="0x5D094" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR9" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR7" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR7" offset="0x5D098" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR10" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR8" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR8" offset="0x5D09C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR11" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR9" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR9" offset="0x5D0A0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR12" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR10" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR10" offset="0x5D0A4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR13" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR11" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR11" offset="0x5D0A8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR14" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR12" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR12" offset="0x5D0AC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR15" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR13" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR13" offset="0x5D0B0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ACTR16" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR14" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR14" offset="0x5D0B4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR15" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR15" offset="0x5D0B8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ACTR16" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ACTR16" offset="0x5D0BC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR1" offset="0x5D0C0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR2" offset="0x5D0C8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR3" offset="0x5D0D0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR4" offset="0x5D0D8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
