IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR5" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR5" offset="0x5D0E0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCVR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR6" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR6" offset="0x5D0E8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR7" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR7" offset="0x5D0F0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCVR8" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCVR8" offset="0x5D0F8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR1" offset="0x5D100" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR2" offset="0x5D108" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR3" offset="0x5D110" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR4" offset="0x5D118" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR5" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR5" offset="0x5D120" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DCMR8" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR6" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR6" offset="0x5D128" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR7" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR7" offset="0x5D130" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DCMR8" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DCMR8" offset="0x5D138" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR1" offset="0x5D140" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR2" offset="0x5D144" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR3" offset="0x5D148" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDVR4" offset="0x5D14C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR1" offset="0x5D150" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTENR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR2" offset="0x5D154" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR3" offset="0x5D158" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTENR4" offset="0x5D15C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR1" offset="0x5D160" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTRLDEVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR2" offset="0x5D164" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
