IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR3" offset="0x5D168" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTRLDEVR4" offset="0x5D16C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR1" offset="0x5D170" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CNTVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR2" offset="0x5D174" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ12EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR3" offset="0x5D178" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ21EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CNTVR4" offset="0x5D17C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ23EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SQ12EVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SQ12EVR" offset="0x5D180" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ31EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SQ21EVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SQ21EVR" offset="0x5D184" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ32EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SQ23EVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SQ23EVR" offset="0x5D188" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQ13EVR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SQ31EVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SQ31EVR" offset="0x5D18C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SQR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SQ32EVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SQ32EVR" offset="0x5D190" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SQ13EVR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SQ13EVR" offset="0x5D194" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SQR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SQR" offset="0x5D19C" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR1" offset="0x5D1A0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTOUTEVR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR2" offset="0x5D1A4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCVR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR3" offset="0x5D1A8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCVR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_EXTOUTEVR4" offset="0x5D1AC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCVR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CIDCVR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CIDCVR1" offset="0x5D1B0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDCMR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CIDCVR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CIDCVR2" offset="0x5D1B4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_SYNCFR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CIDCVR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CIDCVR3" offset="0x5D1B8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_IDR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CIDCMR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CIDCMR" offset="0x5D1BC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CCER" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
