IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_SYNCFR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_SYNCFR" offset="0x5D1E0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_EXTINSELR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_IDR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_IDR" offset="0x5D1E4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_TRACEIDR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CCER" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CCER" offset="0x5D1E8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PDSR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_EXTINSELR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_EXTINSELR" offset="0x5D1EC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITETMIF" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_TRACEIDR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_TRACEIDR" offset="0x5D200" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITMISCOUT" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PDSR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PDSR" offset="0x5D314" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITMISCIN" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITETMIF" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITETMIF" offset="0x5DED8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITTRIGGERACK" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITMISCOUT" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITMISCOUT" offset="0x5DEDC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITTRIGGERREQ" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITMISCIN" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITMISCIN" offset="0x5DEE0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBDATA0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITTRIGGERACK" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITTRIGGERACK" offset="0x5DEE4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBCTR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITTRIGGERREQ" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITTRIGGERREQ" offset="0x5DEE8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBCTR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITATBDATA0" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITATBDATA0" offset="0x5DEEC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITATBCTR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITATBCTR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITATBCTR2" offset="0x5DEF0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_ITCTRL" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITATBCTR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITATBCTR1" offset="0x5DEF4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CLAIMSET" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITATBCTR0" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITATBCTR0" offset="0x5DEF8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CLAIMCLR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_ITCTRL" acronym="DEBUGSS_MSS_R5SS1_B_ETM_ITCTRL" offset="0x5DF00" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_LAR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="WO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CLAIMSET" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CLAIMSET" offset="0x5DFA0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_LSR" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CLAIMCLR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CLAIMCLR" offset="0x5DFA4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_AUTHSTATUS" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_LAR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_LAR" offset="0x5DFB0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DEVID" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_LSR" acronym="DEBUGSS_MSS_R5SS1_B_ETM_LSR" offset="0x5DFB4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_DEVTYPE" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_AUTHSTATUS" acronym="DEBUGSS_MSS_R5SS1_B_ETM_AUTHSTATUS" offset="0x5DFB8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR4" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DEVID" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DEVID" offset="0x5DFC8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR5" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_DEVTYPE" acronym="DEBUGSS_MSS_R5SS1_B_ETM_DEVTYPE" offset="0x5DFCC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR6" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
