IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/DEBUGSS_DEBUGSS.xml
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR4" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR4" offset="0x5DFD0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR7" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR5" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR5" offset="0x5DFD4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR6" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR6" offset="0x5DFD8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR7" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR7" offset="0x5DFDC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR0" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR0" offset="0x5DFE0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_PIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR1" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR1" offset="0x5DFE4" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDR0" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR2" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR2" offset="0x5DFE8" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDR1" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_PIDR3" acronym="DEBUGSS_MSS_R5SS1_B_ETM_PIDR3" offset="0x5DFEC" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDR2" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="DEBUGSS_MSS_R5SS1_B_ETM_CIDR0" acronym="DEBUGSS_MSS_R5SS1_B_ETM_CIDR0" offset="0x5DFF0" width="32" description="">
		<bitfield id="MSS_R5SS1_ETM_CIDR3" width="32" begin="31" end="0" resetval="0x0" description="Not Defined" range="31 - 0" rwaccess="RO"/>
	</register>
</module>